-- MySQL dump 10.13  Distrib 8.4.5, for Win64 (x86_64)
--
-- Host: localhost    Database: bjs-pa
-- ------------------------------------------------------
-- Server version	8.4.5

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `aikeys`
--

DROP TABLE IF EXISTS `aikeys`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `aikeys` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `keyname` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `aikey` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  PRIMARY KEY (`ID`)
) ENGINE=InnoDB AUTO_INCREMENT=12 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `aikeys`
--

LOCK TABLES `aikeys` WRITE;
/*!40000 ALTER TABLE `aikeys` DISABLE KEYS */;
INSERT INTO `aikeys` VALUES (1,'key_text','This is key. Keep it safe!');
/*!40000 ALTER TABLE `aikeys` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bjs_pa`
--

DROP TABLE IF EXISTS `bjs_pa`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `bjs_pa` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `pa_num` int NOT NULL DEFAULT '0',
  `pa_content` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `pa_score` int NOT NULL DEFAULT '0',
  `pa_group` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `task_group` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `min_days` int NOT NULL DEFAULT '0',
  `multi_score` tinyint(1) NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`),
  KEY `nci_pa_num` (`pa_num`),
  KEY `nci_pa_score` (`pa_score`),
  KEY `nci_min_days` (`min_days`)
) ENGINE=InnoDB AUTO_INCREMENT=272 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bjs_pa`
--

LOCK TABLES `bjs_pa` WRITE;
/*!40000 ALTER TABLE `bjs_pa` DISABLE KEYS */;
INSERT INTO `bjs_pa` VALUES (1,1,'值班（无输油作业，包括设备巡检、安防巡检、记录、卫生）',100,'全员','值班',0,0),(2,3,'值班（输油作业，包括测温巡检、安防巡检、记录、卫生）',150,'全员','值班',0,0),(3,5,'白班/取证培训/出差（每天）',60,'全员','值班',0,1),(4,7,'交接班及填写交接班记录、临时工作打分',10,'全员','值班',0,0),(5,307,'启输',15,'全员','输油作业',0,0),(6,309,'停输',10,'全员','输油作业',0,0),(7,311,'切换流程（现场操作）',30,'全员','输油作业',0,0),(8,313,'配合切换流程（现场确认）',15,'全员','输油作业',0,0),(9,315,'切换过滤器/流量计',10,'全员','输油作业',0,0),(10,317,'旋流器放沉/过滤器放沉',10,'全员','输油作业',0,0),(11,319,'防止管线涨压开展泄压操作',10,'全员','输油作业',0,0),(12,347,'监视、记录油品质量',50,'全员','通球扫线',0,0),(13,349,'监控污油进罐液位',20,'全员','通球扫线',0,0),(14,351,'流程切换',20,'全员','通球扫线',0,0),(15,353,'配合取球',100,'全员','通球扫线',0,0),(17,85,'紧固、更换压力表（每块）',15,'全员','维修保养',0,1),(18,87,'更换过滤器安全阀（每块）/更换旋流器安全阀',30,'全员','维修保养',0,1),(19,89,'阀门保养',30,'全员','维修保养',0,0),(20,91,'更换泵、电机润滑油（每台泵组）',150,'全员','维修保养',0,1),(21,93,'添加泵、电机润滑油（每处每次）',10,'全员','维修保养',0,1),(22,95,'埋地罐提油',90,'全员','维修保养',0,0),(23,97,'检查、清洗篮式过滤器',100,'全员','维修保养',0,0),(24,99,'更换泵机械密封/泵轴承/电机轴承',300,'全员','维修保养',0,0),(25,101,'电机除尘',100,'全员','维修保养',0,0),(26,103,'拆泵联轴器',20,'全员','维修保养',0,0),(27,105,'装泵联轴器',30,'全员','维修保养',0,0),(28,107,'协助调试流量计等设备/协助拆装阀门等设备',20,'全员','维修保养',0,0),(29,109,'检查维保清理阻火器',60,'全员','维修保养',0,0),(30,111,'检查维保呼吸阀',60,'全员','维修保养',0,0),(31,113,'更换压力表标签',2,'全员','维修保养',0,0),(32,115,'清洗泄压阀前端过滤器（将要安装）',100,'全员','维修保养',0,0),(33,117,'管道设备防腐刷漆、刷地坪漆等',30,'全员','维修保养',0,0),(34,119,'配合清洗油罐',50,'全员','维修保养',0,0),(35,321,'新滤芯出库搬运',60,'全员','过滤器更换',0,0),(36,323,'新滤芯拆箱及向上传递',80,'全员','过滤器更换',0,0),(37,325,'旧滤芯卸车',80,'全员','过滤器更换',0,0),(38,327,'从近端过滤器中提取旧滤芯',80,'全员','过滤器更换',0,0),(39,329,'从中端过滤器中提取旧滤芯',100,'全员','过滤器更换',0,0),(40,331,'从远端过滤器中提取旧滤芯',120,'全员','过滤器更换',0,0),(41,333,'从过滤器中提取旧滤芯',60,'全员','过滤器更换',0,0),(42,335,'过滤器端盖螺栓松开和紧固',30,'全员','过滤器更换',0,0),(43,337,'过滤器密封圈更换',15,'全员','过滤器更换',0,0),(44,339,'过滤器揭示牌填写',5,'全员','过滤器更换',0,0),(45,341,'过滤器更换完毕后总巡查',30,'全员','过滤器更换',0,0),(46,343,'过滤器更换记录',5,'全员','过滤器更换',0,0),(47,345,'滤芯出入库记录填写',5,'全员','过滤器更换',0,0),(48,13,'UPS放电测试及填写记录',30,'刘斌','检测检查',0,0),(49,15,'消防器材检查、擦拭、填写记录',50,'王磊','检测检查',0,0),(50,17,'更换消防器材（每年一次，包含送检及接收）',40,'全员','检测检查',0,0),(51,19,'摇测接地电阻（每处）',10,'全员','检测检查',0,1),(52,21,'泄压阀开启值调整',15,'全员','检测检查',0,0),(53,23,'泄压阀有效性检测',60,'全员','检测检查',0,0),(54,25,'配合开展安全检查',10,'全员','检测检查',0,0),(55,27,'安全自查/专项自查（含记录填写）',25,'全员','检测检查',0,0),(56,29,'配合防雷检测',15,'全员','检测检查',0,0),(57,31,'配合可燃气体监测（每处）',3,'全员','检测检查',0,1),(58,33,'配合消电检检测',20,'全员','检测检查',0,0),(59,35,'测试消防报警按钮（两处）',10,'全员','检测检查',0,0),(60,37,'检查火灾报警控制器（每周一）',3,'全员','检测检查',0,0),(61,39,'打扫接油棚地面，清洁泵组及附属管线、阀门、过滤器等(每季度一次)',150,'全员','清理保洁',88,0),(62,41,'清除接油棚杂物及杂草',10,'全员','清理保洁',0,0),(63,43,'清扫站区内积雪',80,'全员','清理保洁',0,0),(64,45,'清扫操控台下机柜、清扫PLC机柜及网络机柜（每季度）',60,'全员','清理保洁',0,0),(65,47,'便池清洁',50,'全员','清理保洁',0,0),(66,49,'洗手池清洁',20,'全员','清理保洁',0,0),(67,51,'洗澡间清洁',30,'全员','清理保洁',0,0),(68,53,'清扫站内落叶',40,'全员','清理保洁',0,0),(69,55,'值班室卫生清洁',15,'全员','清理保洁',0,0),(70,57,'办公室卫生清洁',15,'全员','清理保洁',0,0),(71,59,'会议室卫生（每人次）',40,'全员','清理保洁',0,0),(72,61,'擦拭泵区渗油点（每处）',5,'全员','清理保洁',0,1),(73,63,'每周一次大扫除',150,'全员','清理保洁',0,0),(74,65,'清洗空调滤网（每台）（每半年一次）',10,'全员','清理保洁',0,1),(75,67,'刷饮用水桶/水管',15,'全员','清理保洁',0,0),(76,69,'洗凉床单（每条）',10,'全员','清理保洁',0,1),(77,71,'擦玻璃（门斗）',150,'全员','清理保洁',0,0),(78,73,'擦玻璃（控制室）',90,'全员','清理保洁',0,0),(79,75,'擦玻璃（会议室）',60,'全员','清理保洁',0,0),(80,77,'擦玻璃（3间值班室）',90,'全员','清理保洁',0,0),(81,79,'擦玻璃（北侧卫生间+洗澡间）',75,'全员','清理保洁',0,0),(82,81,'擦玻璃（南侧办公室）',120,'全员','清理保洁',0,0),(83,83,'擦玻璃（南侧卫生间+洗澡间）',90,'全员','清理保洁',0,0),(84,275,'财务报销（包含审核与贴票）',10,'穆天赛','财务工作',0,0),(85,277,'帐目管理',50,'穆天赛','财务工作',0,0),(86,279,'请款',5,'穆天赛','财务工作',0,0),(87,281,'年底结算',30,'穆天赛','财务工作',0,0),(88,283,'水电费结算工作（包含去动力能源公司进行费用分割）',50,'穆天赛','财务工作',0,0),(89,285,'饭卡充值工作（包含取收据及充值）',50,'穆天赛','财务工作',0,0),(90,287,'社保基数核定',20,'穆天赛','财务工作',0,0),(91,289,'国家企业信息报送工作',20,'穆天赛','财务工作',0,0),(92,291,'商险药费报销',30,'穆天赛','财务工作',0,0),(93,293,'社保系统日常维护',30,'穆天赛','财务工作',0,0),(94,295,'社保系统增减员(非现场)',20,'穆天赛','财务工作',0,0),(95,297,'社保系统增减员(现场)',40,'穆天赛','财务工作',0,0),(96,299,'误餐统计',20,'穆天赛','财务工作',0,0),(97,301,'办理北京站询证函',20,'穆天赛','财务工作',0,0),(98,303,'每季度前往建行办理对账单',20,'穆天赛','财务工作',0,0),(99,305,'快递费月结统计',20,'穆天赛','财务工作',0,0),(100,121,'管理滤芯库房(每月一次)',50,'刘泽坤','行政管理',28,0),(101,123,'计量台账管理(每月一次)',30,'王磊','行政管理',28,0),(102,125,'办公物品出入库管理(每月一次)',80,'穆天赛','行政管理',28,0),(103,127,'管理工具柜及物资台账（含应急器材、应急器材柜管理, 每月一次）',60,'罗泽朝','行政管理',28,0),(104,129,'管理北京站设备台账及设备管理系统(每月一次)',40,'刘斌','行政管理',28,0),(105,131,'上报北京站周报、安全信息月报表、考勤表、值班表、值班费表、带班费表、高温津贴表、班组活动台账、培训计划表、培训实施统计表等报表',10,'王磊','行政管理',0,0),(106,133,'上报请示',5,'王磊','行政管理',0,0),(107,135,'常用请示',15,'王磊','行政管理',0,0),(108,137,'专项请示',30,'王磊','行政管理',0,0),(109,139,'填写北京站会议记录',10,'全员','行政管理',0,0),(110,141,'填写北京站培训记录/演练记录',10,'全员','行政管理',0,0),(111,143,'上报北京站全年员工休假计划/统计北京站全年员工休假情况',5,'全员','行政管理',0,0),(112,145,'专项活动总结/年中、年度工作计划、工作总结（每篇）',15,'全员','行政管理',0,1),(113,147,'主写写异常事件报告',30,'全员','行政管理',0,0),(114,149,'协助写异常事件报告',10,'全员','行政管理',0,0),(115,151,'填写北京站设备维修记录',5,'全员','行政管理',0,0),(116,153,'编制操作规程/规章制度/应急预案/演练方案/专项方案',100,'全员','行政管理',0,0),(117,155,'培训记录电子版编辑',10,'全员','行政管理',0,0),(118,157,'班组活动出题及打印判卷归档',20,'全员','行政管理',0,0),(119,159,'专项培训考题（含党务类）',30,'全员','行政管理',0,0),(120,161,'更新隐患治理档案电子台账',10,'全员','行政管理',0,0),(121,163,'党小组相关记录文件撰写（每篇）',10,'全员','行政管理',0,1),(122,165,'填报整改记录',10,'全员','行政管理',0,0),(123,167,'安全驾驶北京站车辆并填写行车记录(单程)',10,'全员','行政管理',0,0),(124,169,'安全驾驶北京站车辆并填写行车记录(往返)',20,'全员','行政管理',0,0),(125,171,'北京站车辆加油并填写加油记录及行车记录',20,'全员','行政管理',0,0),(126,173,'北京站车辆清洗',30,'全员','行政管理',0,0),(127,175,'采买生产资料，低值易耗品',5,'全员','行政管理',0,0),(128,177,'采买生产资料，低值易耗品（含开票）并结算报销',10,'全员','行政管理',0,0),(129,179,'办公用品、记录本的申领',5,'全员','行政管理',0,0),(130,181,'劳保用品（包括工服）订单统计',10,'全员','行政管理',0,0),(131,183,'劳保用品（包括工服）到站后进行核对（包含破损统计）与分发',20,'全员','行政管理',0,0),(132,185,'申领生产资料/换季保养材料',10,'全员','行政管理',0,0),(133,187,'车辆维修询价及上报',20,'全员','行政管理',0,0),(134,189,'北京站车辆送修',20,'全员','行政管理',0,0),(135,191,'车辆年检',50,'全员','行政管理',0,0),(136,193,'参加月度安全生产例会',10,'全员','行政管理',0,0),(137,195,'参加公司会议、培训、演练等活动（每小时）',10,'全员','行政管理',0,1),(138,197,'新闻报道公司公众号',20,'全员','行政管理',0,0),(139,199,'物流公众号',30,'全员','行政管理',0,0),(140,201,'VPN（集团公众号）',80,'全员','行政管理',0,0),(141,203,'编辑公司公众号、物流公众号',10,'全员','行政管理',0,0),(142,205,'编辑集团公众号（每篇）',20,'全员','行政管理',0,1),(143,207,'防汛工作对接员(每月一次)',20,'全员','行政管理',28,0),(144,209,'培训实习生、新职员、施工人员（每次）',100,'全员','行政管理',0,1),(145,211,'完成专项课题（含资料收集、整理，课件、影视频制作等）',600,'全员','行政管理',0,0),(146,213,'制作培训课件（站内、中心、公司授课使用）（工作量小）',100,'全员','行政管理',0,0),(147,215,'制作培训课件（站内、中心、公司授课使用）（工作量中）',200,'全员','行政管理',0,0),(148,217,'制作培训课件（站内、中心、公司授课使用）（工作量大）',300,'全员','行政管理',0,0),(149,219,'站内授课',40,'全员','行政管理',0,0),(150,221,'中心授课',60,'全员','行政管理',0,0),(151,223,'公司授课',80,'全员','行政管理',0,0),(152,225,'班组内开展培训（留存记录或照片）',10,'全员','行政管理',0,0),(153,227,'参加应急演练桌面',10,'全员','行政管理',0,0),(154,229,'班组实战（留存照片）',20,'全员','行政管理',0,0),(155,231,'站内及公司实战',30,'全员','行政管理',0,0),(156,233,'做迎检准备',10,'全员','行政管理',0,0),(157,235,'监护施工、维修、作业（每小时）（需在记录中明确监护时间区间）',20,'全员','行政管理',0,1),(158,237,'办公电脑维护',20,'全员','行政管理',0,0),(159,239,'收集、整理影视频、图片资料',15,'全员','行政管理',0,0),(160,241,'检查药箱药品是否过期并更新表格',10,'全员','行政管理',0,0),(161,243,'配合抄电表/水表',5,'全员','行政管理',0,0),(162,245,'办理特殊作业票（包括安全教育、风险分析等相关报表）',50,'全员','行政管理',0,0),(163,247,'含油废弃物储存间管理(每月一次)',30,'全员','行政管理',28,0),(164,249,'管理维护公共安全帽、反光背心',20,'全员','行政管理',0,0),(165,251,'管理吸油棉箱、静电导除装置、展板、警示牌、磁翻板液位计、应急器材柜等(每月一次)',30,'全员','行政管理',28,0),(166,253,'每季度参加企安安培训与考核',30,'王磊/罗泽朝','行政管理',0,0),(167,255,'合理化建议（每条）',10,'全员','行政管理',0,1),(168,257,'合理化建议被采纳（每条）',20,'全员','行政管理',0,1),(169,259,'每日记录检查',5,'全员','行政管理',0,0),(170,261,'月末记录检查（发现一处问题加2分，当日检查记录人员扣4分）',15,'全员','行政管理',0,0),(171,263,'临时工作记录统计整理',15,'全员','行政管理',0,0),(172,265,'党务工作管理(每月一次)',20,'全员','行政管理',28,0),(173,267,'因公外出培训(每天)',60,'全员','行政管理',0,1),(174,269,'因公出差(每天)',60,'全员','行政管理',0,1),(175,271,'站内图书资料管理(每月一次)',10,'全员','行政管理',28,0),(176,9,'加班(每小时)',10,'全员','加班',0,1),(177,11,'主动加班(每小时)',12,'全员','加班',0,1),(178,355,'填写通球扫线报告',20,'全员','通球扫线',0,0),(179,273,'月末记录检查发现错误',2,'全员','行政管理',0,1);
/*!40000 ALTER TABLE `bjs_pa` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bjs_pa_deduct`
--

DROP TABLE IF EXISTS `bjs_pa_deduct`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `bjs_pa_deduct` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `pa_num` int NOT NULL DEFAULT '0',
  `pa_content` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `pa_score` tinyint NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`),
  KEY `nci_pa_num` (`pa_num`),
  KEY `nci_pa_score` (`pa_score`)
) ENGINE=InnoDB AUTO_INCREMENT=280 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bjs_pa_deduct`
--

LOCK TABLES `bjs_pa_deduct` WRITE;
/*!40000 ALTER TABLE `bjs_pa_deduct` DISABLE KEYS */;
INSERT INTO `bjs_pa_deduct` VALUES (1,1,'工作不认真',-2),(2,3,'工作未完成',-3),(3,5,'工作有错误',-5),(4,7,'不服从工作安排',-10),(276,9,'工作有错误test',-9),(277,11,'不服从工作安排ss',-10),(278,13,'不服从工作安排ssss',-10),(279,15,'不服从工作安排s',-10);
/*!40000 ALTER TABLE `bjs_pa_deduct` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `clerk_work`
--

DROP TABLE IF EXISTS `clerk_work`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `clerk_work` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `task_date` date NOT NULL,
  `clerk_id` int NOT NULL,
  `clerk_cname` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `clerk_work` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `task_score` int NOT NULL,
  `task_group` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `task_approved` tinyint DEFAULT '0',
  PRIMARY KEY (`ID`),
  KEY `nci_task_date` (`task_date`),
  KEY `nci_clerk_id` (`clerk_id`),
  KEY `nci_task_score` (`task_score`)
) ENGINE=InnoDB AUTO_INCREMENT=55 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `clerk_work`
--

LOCK TABLES `clerk_work` WRITE;
/*!40000 ALTER TABLE `clerk_work` DISABLE KEYS */;
INSERT INTO `clerk_work` VALUES (1,'2025-07-04',1,'刘斌','洗手池清洁',20,'清理保洁',1),(2,'2025-07-04',1,'刘斌','办公室卫生清洁',16,'清理保洁',1),(3,'2025-07-04',1,'刘斌','值班（输油作业，包括测温巡检、安防巡检、记录、卫生）',150,'值班',1),(4,'2025-07-04',1,'刘斌','交接班及填写交接班记录、临时工作打分',10,'值班',1),(5,'2025-07-04',1,'刘斌','切换流程（现场操作）',30,'输油作业',1),(6,'2025-07-04',1,'刘斌','启输',15,'输油作业',1),(7,'2025-07-04',1,'刘斌','值班室卫生清洁',15,'清理保洁',1),(8,'2025-07-04',1,'刘斌','洗澡间清洁',30,'清理保洁',1),(11,'2025-07-09',1,'刘斌','值班（无输油作业，包括设备巡检、安防巡检、记录、卫生）',10,'值班',0),(14,'2025-07-09',1,'刘斌','新滤芯拆箱及向上传递',80,'过滤器更换',0),(15,'2025-07-09',1,'刘斌','从中端过滤器中提取旧滤芯',100,'过滤器更换',0),(16,'2025-07-09',1,'刘斌','值班室卫生清洁',15,'清理保洁',0),(17,'2025-07-11',1,'刘斌','填写北京站培训记录/演练记录',10,'行政管理',0),(18,'2025-07-11',1,'刘斌','清扫站内落叶',40,'清理保洁',0),(19,'2025-07-11',1,'刘斌','值班（无输油作业，包括设备巡检、安防巡检、记录、卫生）',100,'值班',0),(20,'2025-07-11',1,'刘斌','从近端过滤器中提取旧滤芯',80,'过滤器更换',0),(21,'2025-07-11',1,'刘斌','新滤芯出库搬运',60,'过滤器更换',0),(22,'2025-07-11',1,'刘斌','洗凉床单（每条）',20,'清理保洁',0),(23,'2025-07-11',1,'刘斌','新滤芯拆箱及向上传递',80,'过滤器更换',0),(24,'2025-07-11',1,'刘斌','刷饮用水桶/水管',15,'清理保洁',0),(25,'2025-07-11',1,'刘斌','从中端过滤器中提取旧滤芯',100,'过滤器更换',0),(26,'2025-07-11',1,'刘斌','填写北京站会议记录',10,'行政管理',0),(27,'2025-07-09',1,'刘斌','计量台账管理(每月一次)',30,'行政管理',0),(28,'2025-07-09',1,'刘斌','打扫接油棚地面，清洁泵组及附属管线、阀门、过滤器等(每季度一次)',150,'清理保洁',0),(29,'2025-07-09',1,'刘斌','办公物品出入库管理(每月一次)',80,'行政管理',0),(30,'2025-07-09',1,'刘斌','清除接油棚杂物及杂草',10,'清理保洁',0),(31,'2025-07-17',1,'刘斌','计量台账管理(每月一次)',30,'行政管理',0),(32,'2025-07-17',1,'刘斌','打扫接油棚地面，清洁泵组及附属管线、阀门、过滤器等(每季度一次)',150,'清理保洁',0),(33,'2025-07-17',1,'刘斌','办公物品出入库管理(每月一次)',80,'行政管理',0),(34,'2025-07-17',1,'刘斌','清除接油棚杂物及杂草',10,'清理保洁',0),(38,'2025-07-05',6,'王磊','消防器材检查、擦拭、填写记录',50,'检测检查',1),(44,'2025-07-04',1,'刘斌','不服从工作安排ss',-10,'扣分',1),(45,'2025-07-02',1,'刘斌','不服从工作安排ssss',-10,'扣分',1),(48,'2025-07-05',5,'黄彪','工作未完成',-3,'扣分',1),(49,'2025-07-03',1,'刘斌','不服从工作安排',-10,'扣分',1),(50,'2025-07-02',1,'刘斌','不服从工作安排',-10,'扣分',1),(51,'2025-07-03',1,'刘斌','不服从工作安排ss',-10,'扣分',1),(52,'2025-07-05',1,'刘斌','工作不认真',-2,'扣分',1),(53,'2025-07-05',4,'罗泽朝','工作未完成',-3,'扣分',1),(54,'2025-07-05',4,'罗泽朝','不服从工作安排ss',-10,'扣分',1);
/*!40000 ALTER TABLE `clerk_work` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `users` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `userID` int NOT NULL,
  `userCName` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `userType` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `StationCN` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `userPassword` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `clerk_pa` tinyint DEFAULT '1',
  PRIMARY KEY (`ID`),
  KEY `nci_useid` (`userID`)
) ENGINE=InnoDB AUTO_INCREMENT=90 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES (1,1,'刘斌','admin','北京站','U2FsdGVkX18CKe2EGcK4shHejIs44cr8OPemKU/GKPI=',1),(2,2,'于涛','admin','北京站','U2FsdGVkX1+dssFo4EYsvRuiyZYnAGUQEpyXcUee/3Q=',0),(3,3,'蔚江军','admin','北京站','U2FsdGVkX19CUid39R7p6wMLMhRLqtj4MDbzeYF1FFg=',0),(4,4,'罗泽朝','user','北京站','U2FsdGVkX1/qYuqLBW++JLMuwVh+SRrKeCsbudL6waM=',1),(5,5,'黄彪','user','北京站','U2FsdGVkX185G5av5BUqy6kfL9Y9uvrfqGSepTmOGPk=',1),(6,6,'王磊','user','北京站','U2FsdGVkX1/JzQNqtEqNuWGgTt1bwz7UBbZYqwI47f4=',1),(7,7,'连春生','user','北京站','U2FsdGVkX1/9x8EnJz1LinbJc9CHdMV52IP4qs+/yKI=',1),(8,8,'穆天赛','user','北京站','U2FsdGVkX1+Bxxyzsb6Eug8p687ZNQIlVYzDHY/GCZs=',1),(9,9,'穆玲','user','北京站','U2FsdGVkX18nLb8dwnRYzwFufhOinfkJebHZd1nGS5c=',1),(10,10,'刘泽坤','user','北京站','U2FsdGVkX1+CfoZTOasxy7yaKzxJ20BYXYYEsu61/cU=',1),(11,11,'杜操','user','北京站','U2FsdGVkX18TAi1sE45a83ebirfsLr4jmSmCqTV/VX4=',1),(12,12,'于斌','user','北京站','U2FsdGVkX18TAi1sE45a83ebirfsLr4jmSmCqTV/VX4=',1);
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `verinfo`
--

DROP TABLE IF EXISTS `verinfo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `verinfo` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `pyFile` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `pyLM` int NOT NULL,
  `pyMC` int NOT NULL,
  PRIMARY KEY (`ID`)
) ENGINE=InnoDB AUTO_INCREMENT=5252 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `verinfo`
--

LOCK TABLES `verinfo` WRITE;
/*!40000 ALTER TABLE `verinfo` DISABLE KEYS */;
INSERT INTO `verinfo` VALUES (1,'commFunc',1751596724,2),(2,'visitcounter',116,0),(3,'commFunc',1751596724,2),(4,'mysql_pool',1751596724,2),(5,'bjs-pa',1751704594,39),(6,'commModules',1751525213,4),(5250,'etest',1751600723,3),(5251,'tcli',1751534421,2);
/*!40000 ALTER TABLE `verinfo` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-07-05 16:45:10
