-- MySQL dump 10.13  Distrib 8.4.5, for Win64 (x86_64)
--
-- Host: localhost    Database: bjs-pa
-- ------------------------------------------------------
-- Server version	8.4.5

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `aikeys`
--

DROP TABLE IF EXISTS `aikeys`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `aikeys` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `keyname` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `aikey` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  PRIMARY KEY (`ID`)
) ENGINE=InnoDB AUTO_INCREMENT=12 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `aikeys`
--

LOCK TABLES `aikeys` WRITE;
/*!40000 ALTER TABLE `aikeys` DISABLE KEYS */;
INSERT INTO `aikeys` VALUES (1,'key_text','This is key. Keep it safe!');
/*!40000 ALTER TABLE `aikeys` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bjs_pa`
--

DROP TABLE IF EXISTS `bjs_pa`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `bjs_pa` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `pa_num` int NOT NULL DEFAULT '0',
  `pa_content` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `pa_score` int NOT NULL DEFAULT '0',
  `pa_group` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `task_group` tinytext COLLATE utf8mb4_unicode_ci,
  `min_days` int DEFAULT '0',
  PRIMARY KEY (`ID`),
  KEY `nci_pa_num` (`pa_num`),
  KEY `nci_pa_score` (`pa_score`),
  KEY `nci_min_days` (`min_days`)
) ENGINE=InnoDB AUTO_INCREMENT=266 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bjs_pa`
--

LOCK TABLES `bjs_pa` WRITE;
/*!40000 ALTER TABLE `bjs_pa` DISABLE KEYS */;
INSERT INTO `bjs_pa` VALUES (1,1,'值班（无输油作业，包括设备巡检、安防巡检、记录、卫生）',100,'全员','值班',0),(2,3,'值班（输油作业，包括测温巡检、安防巡检、记录、卫生）',150,'全员','值班',0),(3,5,'白班/取证培训/出差（每天）',60,'全员','值班',0),(4,7,'交接班及填写交接班记录、临时工作打分',10,'全员','值班',0),(5,9,'启输',15,'全员','输油作业',0),(6,11,'停输',10,'全员','输油作业',0),(7,13,'切换流程（现场操作）',30,'全员','输油作业',0),(8,15,'配合切换流程（现场确认）',15,'全员','输油作业',0),(9,17,'切换过滤器/流量计',10,'全员','输油作业',0),(10,19,'旋流器放沉/过滤器放沉',10,'全员','输油作业',0),(11,21,'防止管线涨压开展泄压操作',10,'全员','输油作业',0),(12,23,'监视、记录油品质量',50,'全员','通球扫线',0),(13,25,'监控污油进罐液位',20,'全员','通球扫线',0),(14,27,'流程切换',20,'全员','通球扫线',0),(15,29,'配合取球',100,'全员','通球扫线',0),(16,31,'填写通球扫线报告',20,'全员','通球扫线',0),(17,33,'紧固、更换压力表（每块）',15,'全员','维修保养',0),(18,35,'更换过滤器安全阀（每块）/更换旋流器安全阀',30,'全员','维修保养',0),(19,37,'阀门保养',30,'全员','维修保养',0),(20,39,'更换泵、电机润滑油（每台泵组）',150,'全员','维修保养',0),(21,41,'添加泵、电机润滑油（每处每次）',10,'全员','维修保养',0),(22,43,'埋地罐提油',90,'全员','维修保养',0),(23,45,'检查、清洗篮式过滤器',100,'全员','维修保养',0),(24,47,'更换泵机械密封/泵轴承/电机轴承',300,'全员','维修保养',0),(25,49,'电机除尘',100,'全员','维修保养',0),(26,51,'拆泵联轴器',20,'全员','维修保养',0),(27,53,'装泵联轴器',30,'全员','维修保养',0),(28,55,'协助调试流量计等设备/协助拆装阀门等设备',20,'全员','维修保养',0),(29,57,'检查维保清理阻火器',60,'全员','维修保养',0),(30,59,'检查维保呼吸阀',60,'全员','维修保养',0),(31,61,'更换压力表标签',2,'全员','维修保养',0),(32,63,'清洗泄压阀前端过滤器（将要安装）',100,'全员','维修保养',0),(33,65,'管道设备防腐刷漆、刷地坪漆等',30,'全员','维修保养',0),(34,67,'配合清洗油罐',50,'全员','维修保养',0),(35,69,'新滤芯出库搬运',60,'全员','过滤器更换',0),(36,71,'新滤芯拆箱及向上传递',80,'全员','过滤器更换',0),(37,73,'旧滤芯卸车',80,'全员','过滤器更换',0),(38,75,'从过滤器中提取旧滤芯1',80,'全员','过滤器更换',0),(39,77,'从过滤器中提取旧滤芯2',100,'全员','过滤器更换',0),(40,79,'从过滤器中提取旧滤芯3',120,'全员','过滤器更换',0),(41,81,'从过滤器中提取旧滤芯1',60,'全员','过滤器更换',0),(42,83,'过滤器端盖螺栓松开和紧固',30,'全员','过滤器更换',0),(43,85,'过滤器密封圈更换',15,'全员','过滤器更换',0),(44,87,'过滤器揭示牌填写',5,'全员','过滤器更换',0),(45,89,'过滤器更换完毕后总巡查',30,'全员','过滤器更换',0),(46,91,'过滤器更换记录',5,'全员','过滤器更换',0),(47,93,'滤芯出入库记录填写',5,'全员','过滤器更换',0),(48,95,'UPS放电测试及填写记录',30,'刘斌','检测检查',0),(49,97,'消防器材检查、擦拭、填写记录',50,'王磊','检测检查',0),(50,99,'更换消防器材（每年一次，包含送检及接收）',40,'全员','检测检查',0),(51,101,'摇测接地电阻（每处）',90,'全员','检测检查',0),(52,103,'泄压阀开启值调整',15,'全员','检测检查',0),(53,105,'泄压阀有效性检测',60,'全员','检测检查',0),(54,107,'配合开展安全检查',10,'全员','检测检查',0),(55,109,'安全自查/专项自查（含记录填写）',25,'全员','检测检查',0),(56,111,'配合防雷检测',15,'全员','检测检查',0),(57,113,'配合可燃气体监测（每处）',3,'全员','检测检查',0),(58,115,'配合消电检检测',20,'全员','检测检查',0),(59,117,'测试消防报警按钮（两处）',10,'全员','检测检查',0),(60,119,'检查火灾报警控制器（每周一）',3,'全员','检测检查',0),(61,121,'打扫接油棚地面，清洁泵组及附属管线、阀门、过滤器等',150,'全员','清理保洁',88),(62,123,'清除接油棚杂物及杂草',10,'全员','清理保洁',0),(63,125,'清扫站区内积雪',80,'全员','清理保洁',0),(64,127,'清扫操控台下机柜、清扫PLC机柜及网络机柜（每季度）',60,'全员','清理保洁',0),(65,129,'便池清洁',50,'全员','清理保洁',0),(66,131,'洗手池清洁',20,'全员','清理保洁',0),(67,133,'洗澡间清洁',30,'全员','清理保洁',0),(68,135,'清扫站内落叶',40,'全员','清理保洁',0),(69,137,'值班室卫生清洁',15,'全员','清理保洁',0),(70,139,'办公室卫生清洁',15,'全员','清理保洁',0),(71,141,'会议室卫生（每人次）',40,'全员','清理保洁',0),(72,143,'擦拭泵区渗油点（每处）',5,'全员','清理保洁',0),(73,145,'每周一次大扫除',150,'全员','清理保洁',0),(74,147,'清洗空调滤网（每台）（每半年一次）',10,'全员','清理保洁',0),(75,149,'刷饮用水桶/水管',15,'全员','清理保洁',0),(76,151,'洗凉床单（每条）',10,'全员','清理保洁',0),(77,153,'擦玻璃（门斗）',150,'全员','清理保洁',0),(78,155,'擦玻璃（控制室）',90,'全员','清理保洁',0),(79,157,'擦玻璃（会议室）',60,'全员','清理保洁',0),(80,159,'擦玻璃（3间值班室）',90,'全员','清理保洁',0),(81,161,'擦玻璃（北侧卫生间+洗澡间）',75,'全员','清理保洁',0),(82,163,'擦玻璃（南侧办公室）',120,'全员','清理保洁',0),(83,165,'擦玻璃（南侧卫生间+洗澡间）',90,'全员','清理保洁',0),(84,167,'财务报销（包含审核与贴票）',10,'穆天赛','财务工作',0),(85,169,'帐目管理',50,'穆天赛','财务工作',0),(86,171,'请款',5,'穆天赛','财务工作',0),(87,173,'年底结算',30,'穆天赛','财务工作',0),(88,175,'水电费结算工作（包含去动力能源公司进行费用分割）',50,'穆天赛','财务工作',0),(89,177,'饭卡充值工作（包含取收据及充值）',50,'穆天赛','财务工作',0),(90,179,'社保基数核定',20,'穆天赛','财务工作',0),(91,181,'国家企业信息报送工作',20,'穆天赛','财务工作',0),(92,183,'商险药费报销',30,'穆天赛','财务工作',0),(93,185,'社保系统日常维护',30,'穆天赛','财务工作',0),(94,187,'社保系统增减员(非现场)',20,'穆天赛','财务工作',0),(95,189,'社保系统增减员(现场)',40,'穆天赛','财务工作',0),(96,191,'误餐统计',20,'穆天赛','财务工作',0),(97,193,'办理北京站询证函',20,'穆天赛','财务工作',0),(98,195,'每季度前往建行办理对账单',20,'穆天赛','财务工作',0),(99,197,'快递费月结统计',20,'穆天赛','财务工作',0),(100,199,'管理滤芯库房',50,'刘泽坤','行政管理',28),(101,201,'计量台账管理',30,'王磊','行政管理',28),(102,203,'办公物品出入库管理',80,'穆天赛','行政管理',28),(103,205,'管理工具柜及物资台账（含应急器材、应急器材柜管理）',60,'罗泽朝','行政管理',28),(104,207,'管理北京站设备台账及设备管理系统',40,'刘斌','行政管理',28),(105,209,'上报北京站周报、安全信息月报表、考勤表、值班表、值班费表、带班费表、高温津贴表、班组活动台账、培训计划表、培训实施统计表等报表',10,'王磊','行政管理',0),(106,211,'上报请示',5,'王磊','行政管理',0),(107,213,'常用请示',15,'王磊','行政管理',0),(108,215,'专项请示',30,'王磊','行政管理',0),(109,217,'填写北京站会议记录',10,'全员','行政管理',0),(110,219,'填写北京站培训记录/演练记录',10,'全员','行政管理',0),(111,221,'上报北京站全年员工休假计划/统计北京站全年员工休假情况',5,'全员','行政管理',0),(112,223,'专项活动总结/年中、年度工作计划、工作总结（每篇）',15,'全员','行政管理',0),(113,225,'主写写异常事件报告',30,'全员','行政管理',0),(114,227,'协助写异常事件报告',10,'全员','行政管理',0),(115,229,'填写北京站设备维修记录',5,'全员','行政管理',0),(116,231,'编制操作规程/规章制度/应急预案/演练方案/专项方案',100,'全员','行政管理',0),(117,233,'培训记录电子版编辑',10,'全员','行政管理',0),(118,235,'班组活动出题及打印判卷归档',20,'全员','行政管理',0),(119,237,'专项培训考题（含党务类）',30,'全员','行政管理',0),(120,239,'更新隐患治理档案电子台账',10,'全员','行政管理',0),(121,241,'党小组相关记录文件撰写（每篇）',10,'全员','行政管理',0),(122,243,'填报整改记录',10,'全员','行政管理',0),(123,245,'安全驾驶北京站车辆并填写行车记录(单程)',10,'全员','行政管理',0),(124,247,'安全驾驶北京站车辆并填写行车记录(往返)',20,'全员','行政管理',0),(125,249,'北京站车辆加油并填写加油记录及行车记录',20,'全员','行政管理',0),(126,251,'北京站车辆清洗',30,'全员','行政管理',0),(127,253,'采买生产资料，低值易耗品',5,'全员','行政管理',0),(128,255,'采买生产资料，低值易耗品（含开票）并结算报销',10,'全员','行政管理',0),(129,257,'办公用品、记录本的申领',5,'全员','行政管理',0),(130,259,'劳保用品（包括工服）订单统计',10,'全员','行政管理',0),(131,261,'劳保用品（包括工服）到站后进行核对（包含破损统计）与分发',20,'全员','行政管理',0),(132,263,'申领生产资料/换季保养材料',10,'全员','行政管理',0),(133,265,'车辆维修询价及上报',20,'全员','行政管理',0),(134,267,'北京站车辆送修',20,'全员','行政管理',0),(135,269,'车辆年检',50,'全员','行政管理',0),(136,271,'参加月度安全生产例会',10,'全员','行政管理',0),(137,273,'参加公司会议、培训、演练等活动（每小时）',10,'全员','行政管理',0),(138,275,'新闻报道公司公众号',20,'全员','行政管理',0),(139,277,'物流公众号',30,'全员','行政管理',0),(140,279,'VPN（集团公众号）',80,'全员','行政管理',0),(141,281,'编辑公司公众号、物流公众号',10,'全员','行政管理',0),(142,283,'编辑集团公众号（每篇）',20,'全员','行政管理',0),(143,285,'防汛工作对接员',20,'全员','行政管理',28),(144,287,'培训实习生、新职员、施工人员（每次）',100,'全员','行政管理',0),(145,289,'完成专项课题（含资料收集、整理，课件、影视频制作等）',600,'全员','行政管理',0),(146,291,'制作培训课件（站内、中心、公司授课使用）（工作量小）',100,'全员','行政管理',0),(147,293,'制作培训课件（站内、中心、公司授课使用）（工作量中）',200,'全员','行政管理',0),(148,295,'制作培训课件（站内、中心、公司授课使用）（工作量大）',300,'全员','行政管理',0),(149,297,'站内授课',40,'全员','行政管理',0),(150,299,'中心授课',60,'全员','行政管理',0),(151,301,'公司授课',80,'全员','行政管理',0),(152,303,'班组内开展培训（留存记录或照片）',10,'全员','行政管理',0),(153,305,'参加应急演练桌面',10,'全员','行政管理',0),(154,307,'班组实战（留存照片）',20,'全员','行政管理',0),(155,309,'站内及公司实战',30,'全员','行政管理',0),(156,311,'做迎检准备',10,'全员','行政管理',0),(157,313,'监护施工、维修、作业（每小时）（需在记录中明确监护时间区间）',20,'全员','行政管理',0),(158,315,'办公电脑维护',20,'全员','行政管理',0),(159,317,'收集、整理影视频、图片资料',15,'全员','行政管理',0),(160,319,'检查药箱药品是否过期并更新表格',10,'全员','行政管理',0),(161,321,'配合抄电表/水表',5,'全员','行政管理',0),(162,323,'办理特殊作业票（包括安全教育、风险分析等相关报表）',50,'全员','行政管理',0),(163,325,'含油废弃物储存间管理',30,'全员','行政管理',28),(164,327,'管理维护公共安全帽、反光背心',20,'全员','行政管理',0),(165,329,'管理吸油棉箱、静电导除装置、展板、警示牌、磁翻板液位计、应急器材柜等',30,'全员','行政管理',28),(166,331,'每季度参加企安安培训与考核',30,'王磊/罗泽朝','行政管理',0),(167,333,'合理化建议（每条）',10,'全员','行政管理',0),(168,335,'合理化建议被采纳（每条）',20,'全员','行政管理',0),(169,337,'每日记录检查',5,'全员','行政管理',0),(170,339,'月末记录检查（发现一处问题加2分，当日检查记录人员扣4分）',15,'全员','行政管理',0),(171,341,'临时工作记录统计整理',15,'全员','行政管理',0),(172,343,'党务工作管理',20,'全员','行政管理',28),(173,345,'因公外出培训(每天)',60,'全员','行政管理',0),(174,347,'因公出差(每天)',60,'全员','行政管理',0),(175,349,'站内图书资料管理',10,'全员','行政管理',28),(176,351,'加班(每小时)',10,'全员','加班',0),(177,353,'主动加班(每小时)',12,'全员','加班',0);
/*!40000 ALTER TABLE `bjs_pa` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `users` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `userName` int NOT NULL,
  `userCName` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `userType` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `StationCN` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `userPassword` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  PRIMARY KEY (`ID`),
  KEY `nci_username` (`userName`)
) ENGINE=InnoDB AUTO_INCREMENT=89 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES (1,1,'刘斌','admin','北京站','U2FsdGVkX1/qIYrlr/JHZ0pjRaEgSmnH0Iam32uT3SM='),(2,2,'于涛','admin','北京站','U2FsdGVkX1+dssFo4EYsvRuiyZYnAGUQEpyXcUee/3Q='),(3,3,'蔚江军','admin','北京站','U2FsdGVkX19CUid39R7p6wMLMhRLqtj4MDbzeYF1FFg='),(4,4,'罗泽朝','user','北京站','U2FsdGVkX1/qYuqLBW++JLMuwVh+SRrKeCsbudL6waM='),(5,5,'黄彪','user','北京站','U2FsdGVkX185G5av5BUqy6kfL9Y9uvrfqGSepTmOGPk='),(6,6,'王磊','user','北京站','U2FsdGVkX1/JzQNqtEqNuWGgTt1bwz7UBbZYqwI47f4='),(7,7,'连春生','user','北京站','U2FsdGVkX1/9x8EnJz1LinbJc9CHdMV52IP4qs+/yKI='),(8,8,'穆天赛','user','北京站','U2FsdGVkX1+Bxxyzsb6Eug8p687ZNQIlVYzDHY/GCZs='),(9,9,'穆玲','user','北京站','U2FsdGVkX18nLb8dwnRYzwFufhOinfkJebHZd1nGS5c='),(10,10,'刘泽坤','user','北京站','U2FsdGVkX1+CfoZTOasxy7yaKzxJ20BYXYYEsu61/cU='),(11,11,'杜操','user','北京站','U2FsdGVkX18TAi1sE45a83ebirfsLr4jmSmCqTV/VX4=');
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `verinfo`
--

DROP TABLE IF EXISTS `verinfo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `verinfo` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `pyFile` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `pyLM` int NOT NULL,
  `pyMC` int NOT NULL,
  PRIMARY KEY (`ID`)
) ENGINE=InnoDB AUTO_INCREMENT=5251 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `verinfo`
--

LOCK TABLES `verinfo` WRITE;
/*!40000 ALTER TABLE `verinfo` DISABLE KEYS */;
INSERT INTO `verinfo` VALUES (1,'commFunc',1751522620,1),(2,'visitcounter',5,0),(3,'commFunc',1751522620,1),(4,'mysql_pool',1751522949,1),(5,'bjs-pa',1751525224,7),(6,'commModules',1751525213,4),(5250,'etest',1751508657,2);
/*!40000 ALTER TABLE `verinfo` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-07-03 17:28:33
