-- MySQL dump 10.13  Distrib 8.4.5, for Win64 (x86_64)
--
-- Host: localhost    Database: gru-pa
-- ------------------------------------------------------
-- Server version	8.4.5

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `aikeys`
--

DROP TABLE IF EXISTS `aikeys`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `aikeys` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `keyname` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `aikey` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  PRIMARY KEY (`ID`)
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `aikeys`
--

LOCK TABLES `aikeys` WRITE;
/*!40000 ALTER TABLE `aikeys` DISABLE KEYS */;
INSERT INTO `aikeys` VALUES (1,'key_text','This is key. Keep it safe!'),(2,'hf_jwt_key','U2FsdGVkX19yRDj7e1+9NfR9SKmaOMwAqG/eNwZ+hR8z9PusMbTk8VG4bPO9FxVZ0TffMT2ZBjVkT47UOtGzQeCA++I5PGaW/+8QBunyfV97nuCX5nJqtJR3UZ8CPvszwfNplU6o8/uooopiCdcacPNNjhWWWFGSahT/E3IaikY6AQzdcIP4vnE0Jcp3+2M1IB99rBXJ7r8de4W990pOxa5oqQWNdfEHXouQOaRrYbM='),(3,'hf_project_id','U2FsdGVkX1/A4XPrhxtcFMxMm+s7e1lc5Pry0qWhcOo='),(4,'hf_jwt_id','U2FsdGVkX18UH/nJFxcagFM3x5DqduqTTwGH0A9wx5o=');
/*!40000 ALTER TABLE `aikeys` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `clerk_work`
--

DROP TABLE IF EXISTS `clerk_work`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `clerk_work` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `task_date` date NOT NULL,
  `clerk_id` int NOT NULL,
  `clerk_cname` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `clerk_work` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `task_score` int NOT NULL,
  `task_group` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `task_approved` tinyint DEFAULT '0',
  `StationCN` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  PRIMARY KEY (`ID`),
  KEY `nci_task_date` (`task_date`),
  KEY `nci_clerk_id` (`clerk_id`),
  KEY `nci_task_score` (`task_score`)
) ENGINE=InnoDB AUTO_INCREMENT=187 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `clerk_work`
--

LOCK TABLES `clerk_work` WRITE;
/*!40000 ALTER TABLE `clerk_work` DISABLE KEYS */;
INSERT INTO `clerk_work` VALUES (1,'2025-07-04',1,'刘斌','洗手池清洁',20,'清理保洁',1,'北京站'),(2,'2025-07-04',1,'刘斌','办公室卫生清洁',16,'清理保洁',0,'北京站'),(3,'2025-07-04',1,'刘斌','值班（输油作业，包括测温巡检、安防巡检、记录、卫生）',150,'值班',0,'北京站'),(4,'2025-07-04',1,'刘斌','交接班及填写交接班记录、临时工作打分',10,'值班',0,'北京站'),(5,'2025-07-04',1,'刘斌','切换流程（现场操作）',30,'输油作业',0,'北京站'),(6,'2025-07-04',1,'刘斌','启输',15,'输油作业',0,'北京站'),(7,'2025-07-04',1,'刘斌','值班室卫生清洁',15,'清理保洁',0,'北京站'),(8,'2025-07-04',1,'刘斌','洗澡间清洁',20,'清理保洁',1,'北京站'),(17,'2025-07-11',1,'刘斌','填写北京站培训记录/演练记录',10,'行政管理',0,'北京站'),(18,'2025-07-11',1,'刘斌','清扫站内落叶',40,'清理保洁',0,'北京站'),(19,'2025-07-11',1,'刘斌','值班（无输油作业，包括设备巡检、安防巡检、记录、卫生）',100,'值班',0,'北京站'),(20,'2025-07-11',1,'刘斌','从近端过滤器中提取旧滤芯',80,'过滤器更换',0,'北京站'),(21,'2025-07-11',1,'刘斌','新滤芯出库搬运',60,'过滤器更换',0,'北京站'),(22,'2025-07-11',1,'刘斌','洗凉床单（每条）',20,'清理保洁',0,'北京站'),(23,'2025-07-11',1,'刘斌','新滤芯拆箱及向上传递',80,'过滤器更换',0,'北京站'),(24,'2025-07-11',1,'刘斌','刷饮用水桶/水管',15,'清理保洁',0,'北京站'),(25,'2025-07-11',1,'刘斌','从中端过滤器中提取旧滤芯',100,'过滤器更换',0,'北京站'),(26,'2025-07-11',1,'刘斌','填写北京站会议记录',10,'行政管理',0,'北京站'),(31,'2025-07-17',1,'刘斌','计量台账管理(每月一次)',30,'行政管理',0,'北京站'),(32,'2025-07-17',1,'刘斌','打扫接油棚地面，清洁泵组及附属管线、阀门、过滤器等(每季度一次)',150,'清理保洁',0,'北京站'),(33,'2025-07-17',1,'刘斌','办公物品出入库管理(每月一次)',80,'行政管理',0,'北京站'),(34,'2025-07-17',1,'刘斌','清除接油棚杂物及杂草',10,'清理保洁',0,'北京站'),(38,'2025-07-05',6,'王磊','消防器材检查、擦拭、填写记录',50,'检测检查',1,'北京站'),(44,'2025-07-04',1,'刘斌','不服从工作安排ss',-10,'扣分',1,'北京站'),(45,'2025-07-02',1,'刘斌','不服从工作安排ssss',-10,'扣分',1,'北京站'),(48,'2025-07-05',5,'黄彪','工作未完成',-3,'扣分',1,'北京站'),(49,'2025-07-03',1,'刘斌','不服从工作安排',-10,'扣分',1,'北京站'),(50,'2025-07-02',1,'刘斌','不服从工作安排',-10,'扣分',1,'北京站'),(51,'2025-07-03',1,'刘斌','不服从工作安排ss',-10,'扣分',1,'北京站'),(52,'2025-07-05',1,'刘斌','工作不认真',-2,'扣分',1,'北京站'),(53,'2025-07-05',4,'罗泽朝','工作未完成',-3,'扣分',1,'北京站'),(54,'2025-07-05',4,'罗泽朝','不服从工作安排ss',-10,'扣分',1,'北京站'),(55,'2025-07-05',1,'刘斌','值班室卫生清洁',15,'清理保洁',0,'北京站'),(56,'2025-07-05',1,'刘斌','交接班及填写交接班记录、临时工作打分',10,'值班',0,'北京站'),(57,'2025-07-05',1,'刘斌','会议室卫生（每人次）',40,'清理保洁',0,'北京站'),(58,'2025-07-05',1,'刘斌','洗澡间清洁',30,'清理保洁',0,'北京站'),(59,'2025-07-05',1,'刘斌','每日记录检查',5,'行政管理',0,'北京站'),(60,'2025-07-02',1,'刘斌','值班室卫生清洁',15,'清理保洁',0,'北京站'),(61,'2025-07-02',1,'刘斌','交接班及填写交接班记录、临时工作打分',10,'值班',1,'北京站'),(62,'2025-07-02',1,'刘斌','会议室卫生（每人次）',40,'清理保洁',0,'北京站'),(63,'2025-07-02',1,'刘斌','洗澡间清洁',30,'清理保洁',0,'北京站'),(64,'2025-07-02',1,'刘斌','每日记录检查',5,'行政管理',0,'北京站'),(65,'2025-07-03',1,'刘斌','新滤芯拆箱及向上传递',80,'过滤器更换',0,'北京站'),(66,'2025-07-03',1,'刘斌','旧滤芯卸车',80,'过滤器更换',0,'北京站'),(67,'2025-07-03',1,'刘斌','值班室卫生清洁',15,'清理保洁',0,'北京站'),(68,'2025-07-03',1,'刘斌','交接班及填写交接班记录、临时工作打分',10,'值班',0,'北京站'),(69,'2025-07-03',1,'刘斌','会议室卫生（每人次）',40,'清理保洁',0,'北京站'),(70,'2025-07-03',1,'刘斌','洗澡间清洁',30,'清理保洁',0,'北京站'),(71,'2025-07-03',1,'刘斌','从近端过滤器中提取旧滤芯',80,'过滤器更换',0,'北京站'),(72,'2025-07-03',1,'刘斌','每日记录检查',5,'行政管理',0,'北京站'),(73,'2025-07-03',1,'刘斌','从中端过滤器中提取旧滤芯',100,'过滤器更换',0,'北京站'),(74,'2025-07-03',7,'连春生','值班室卫生清洁',15,'清理保洁',0,'北京站'),(75,'2025-07-03',7,'连春生','交接班及填写交接班记录、临时工作打分',10,'值班',0,'北京站'),(76,'2025-07-03',7,'连春生','会议室卫生（每人次）',40,'清理保洁',0,'北京站'),(77,'2025-07-03',7,'连春生','洗澡间清洁',30,'清理保洁',0,'北京站'),(78,'2025-07-03',7,'连春生','每日记录检查',5,'行政管理',0,'北京站'),(79,'2025-07-01',7,'连春生','值班室卫生清洁',15,'清理保洁',0,'北京站'),(80,'2025-07-01',7,'连春生','交接班及填写交接班记录、临时工作打分',10,'值班',1,'北京站'),(81,'2025-07-01',7,'连春生','会议室卫生（每人次）',40,'清理保洁',0,'北京站'),(82,'2025-07-01',7,'连春生','洗澡间清洁',30,'清理保洁',0,'北京站'),(83,'2025-07-01',7,'连春生','每日记录检查',5,'行政管理',0,'北京站'),(84,'2025-07-02',7,'连春生','更换消防器材（每年一次，包含送检及接收）',40,'检测检查',0,'北京站'),(85,'2025-07-02',7,'连春生','值班室卫生清洁',15,'清理保洁',0,'北京站'),(86,'2025-07-02',7,'连春生','交接班及填写交接班记录、临时工作打分',10,'值班',0,'北京站'),(87,'2025-07-02',7,'连春生','会议室卫生（每人次）',40,'清理保洁',0,'北京站'),(88,'2025-07-02',7,'连春生','消防器材检查、擦拭、填写记录',50,'检测检查',0,'北京站'),(89,'2025-07-02',7,'连春生','洗澡间清洁',30,'清理保洁',0,'北京站'),(90,'2025-07-02',7,'连春生','每日记录检查',5,'行政管理',0,'北京站'),(91,'2025-07-05',8,'穆天赛','新滤芯拆箱及向上传递',80,'过滤器更换',0,'北京站'),(92,'2025-07-05',8,'穆天赛','值班（输油作业，包括测温巡检、安防巡检、记录、卫生）',150,'值班',0,'北京站'),(93,'2025-07-05',8,'穆天赛','旧滤芯卸车',80,'过滤器更换',0,'北京站'),(94,'2025-07-05',8,'穆天赛','值班（无输油作业，包括设备巡检、安防巡检、记录、卫生）',100,'值班',0,'北京站'),(95,'2025-07-01',8,'穆天赛','新滤芯拆箱及向上传递',80,'过滤器更换',0,'北京站'),(96,'2025-07-01',8,'穆天赛','值班（输油作业，包括测温巡检、安防巡检、记录、卫生）',150,'值班',1,'北京站'),(97,'2025-07-01',8,'穆天赛','从过滤器中提取旧滤芯',60,'过滤器更换',0,'北京站'),(98,'2025-07-01',8,'穆天赛','旧滤芯卸车',80,'过滤器更换',0,'北京站'),(99,'2025-07-01',8,'穆天赛','值班（无输油作业，包括设备巡检、安防巡检、记录、卫生）',100,'值班',1,'北京站'),(100,'2025-07-01',8,'穆天赛','从中端过滤器中提取旧滤芯',100,'过滤器更换',0,'北京站'),(101,'2025-07-05',9,'穆玲','值班（输油作业，包括测温巡检、安防巡检、记录、卫生）',150,'值班',0,'北京站'),(102,'2025-07-05',9,'穆玲','值班室卫生清洁',15,'清理保洁',0,'北京站'),(103,'2025-07-05',9,'穆玲','交接班及填写交接班记录、临时工作打分',10,'值班',0,'北京站'),(104,'2025-07-05',9,'穆玲','会议室卫生（每人次）',40,'清理保洁',0,'北京站'),(105,'2025-07-05',9,'穆玲','洗澡间清洁',30,'清理保洁',0,'北京站'),(106,'2025-07-05',9,'穆玲','每日记录检查',5,'行政管理',0,'北京站'),(107,'2025-07-01',9,'穆玲','值班（输油作业，包括测温巡检、安防巡检、记录、卫生）',150,'值班',1,'北京站'),(108,'2025-07-01',9,'穆玲','值班室卫生清洁',15,'清理保洁',0,'北京站'),(109,'2025-07-01',9,'穆玲','交接班及填写交接班记录、临时工作打分',10,'值班',1,'北京站'),(110,'2025-07-01',9,'穆玲','会议室卫生（每人次）',40,'清理保洁',1,'北京站'),(111,'2025-07-01',9,'穆玲','打扫接油棚地面，清洁泵组及附属管线、阀门、过滤器等(每季度一次)',150,'清理保洁',0,'北京站'),(112,'2025-07-01',9,'穆玲','洗澡间清洁',30,'清理保洁',0,'北京站'),(113,'2025-07-01',9,'穆玲','清除接油棚杂物及杂草',10,'清理保洁',0,'北京站'),(114,'2025-07-01',9,'穆玲','每日记录检查',5,'行政管理',0,'北京站'),(115,'2025-07-03',9,'穆玲','值班（输油作业，包括测温巡检、安防巡检、记录、卫生）',150,'值班',0,'北京站'),(116,'2025-07-03',9,'穆玲','更换消防器材（每年一次，包含送检及接收）',40,'检测检查',0,'北京站'),(117,'2025-07-03',9,'穆玲','值班室卫生清洁',15,'清理保洁',0,'北京站'),(118,'2025-07-03',9,'穆玲','交接班及填写交接班记录、临时工作打分',10,'值班',0,'北京站'),(119,'2025-07-03',9,'穆玲','会议室卫生（每人次）',40,'清理保洁',0,'北京站'),(120,'2025-07-03',9,'穆玲','打扫接油棚地面，清洁泵组及附属管线、阀门、过滤器等(每季度一次)',150,'清理保洁',0,'北京站'),(121,'2025-07-03',9,'穆玲','摇测接地电阻（每处）',40,'检测检查',0,'北京站'),(122,'2025-07-03',9,'穆玲','洗澡间清洁',30,'清理保洁',0,'北京站'),(123,'2025-07-03',9,'穆玲','清除接油棚杂物及杂草',10,'清理保洁',0,'北京站'),(124,'2025-07-03',9,'穆玲','每日记录检查',5,'行政管理',0,'北京站'),(125,'2025-07-05',12,'于斌','值班室卫生清洁',15,'清理保洁',0,'北京站'),(126,'2025-07-05',12,'于斌','交接班及填写交接班记录、临时工作打分',10,'值班',0,'北京站'),(127,'2025-07-05',12,'于斌','会议室卫生（每人次）',40,'清理保洁',0,'北京站'),(128,'2025-07-05',12,'于斌','洗澡间清洁',30,'清理保洁',0,'北京站'),(129,'2025-07-05',12,'于斌','每日记录检查',5,'行政管理',0,'北京站'),(130,'2025-07-05',12,'于斌','监视、记录油品质量',50,'通球扫线',0,'北京站'),(131,'2025-07-05',12,'于斌','办公室卫生清洁',15,'清理保洁',0,'北京站'),(132,'2025-07-05',12,'于斌','清扫站内落叶',40,'清理保洁',0,'北京站'),(133,'2025-07-05',12,'于斌','擦拭泵区渗油点（每处）',25,'清理保洁',0,'北京站'),(134,'2025-07-01',12,'于斌','每日记录检查',5,'行政管理',0,'北京站'),(135,'2025-07-01',12,'于斌','会议室卫生（每人次）',40,'清理保洁',1,'北京站'),(136,'2025-07-01',12,'于斌','值班室卫生清洁',15,'清理保洁',0,'北京站'),(137,'2025-07-01',12,'于斌','交接班及填写交接班记录、临时工作打分',10,'值班',1,'北京站'),(138,'2025-07-01',12,'于斌','洗澡间清洁',30,'清理保洁',0,'北京站'),(139,'2025-07-02',12,'于斌','每日记录检查',5,'行政管理',0,'北京站'),(140,'2025-07-02',12,'于斌','会议室卫生（每人次）',40,'清理保洁',0,'北京站'),(141,'2025-07-02',12,'于斌','值班室卫生清洁',15,'清理保洁',0,'北京站'),(142,'2025-07-02',12,'于斌','交接班及填写交接班记录、临时工作打分',10,'值班',1,'北京站'),(143,'2025-07-02',12,'于斌','洗澡间清洁',30,'清理保洁',0,'北京站'),(144,'2025-07-02',12,'于斌','值班（输油作业，包括测温巡检、安防巡检、记录、卫生）',150,'值班',0,'北京站'),(145,'2025-07-03',12,'于斌','每日记录检查',5,'行政管理',0,'北京站'),(146,'2025-07-03',12,'于斌','会议室卫生（每人次）',40,'清理保洁',0,'北京站'),(147,'2025-07-03',12,'于斌','值班室卫生清洁',15,'清理保洁',0,'北京站'),(148,'2025-07-03',12,'于斌','交接班及填写交接班记录、临时工作打分',10,'值班',1,'北京站'),(149,'2025-07-03',12,'于斌','洗澡间清洁',30,'清理保洁',0,'北京站'),(150,'2025-07-03',12,'于斌','值班（输油作业，包括测温巡检、安防巡检、记录、卫生）',150,'值班',0,'北京站'),(151,'2025-07-07',1,'刘斌','会议室卫生（每人次）',40,'清理保洁',0,'北京站'),(152,'2025-07-07',1,'刘斌','值班室卫生清洁',15,'清理保洁',0,'北京站'),(153,'2025-07-07',1,'刘斌','洗澡间清洁',30,'清理保洁',0,'北京站'),(154,'2025-07-07',1,'刘斌','每日记录检查',5,'行政管理',0,'北京站'),(155,'2025-07-07',1,'刘斌','交接班及填写交接班记录、临时工作打分',10,'值班',0,'北京站'),(156,'2025-07-08',1,'刘斌','每日记录检查',5,'行政管理',0,'北京站'),(158,'2025-07-08',1,'刘斌','旧滤芯卸车',80,'过滤器更换',0,'北京站'),(159,'2025-07-08',1,'刘斌','交接班及填写交接班记录、临时工作打分',10,'值班',0,'北京站'),(160,'2025-07-08',1,'刘斌','会议室卫生（每人次）',40,'清理保洁',0,'北京站'),(161,'2025-07-08',1,'刘斌','值班室卫生清洁',15,'清理保洁',0,'北京站'),(162,'2025-07-07',1,'刘斌','清扫操控台下机柜、清扫PLC机柜及网络机柜（每季度）',60,'清理保洁',0,'北京站'),(163,'2025-07-07',1,'刘斌','旧滤芯卸车',80,'过滤器更换',0,'北京站'),(164,'2025-07-07',1,'刘斌','清扫站内落叶',40,'清理保洁',0,'北京站'),(165,'2025-07-08',1,'刘斌','stesx',10,'输油作业',0,'北京站'),(166,'2025-07-08',1,'刘斌','工作未完成s',-3,'扣分',1,'北京站'),(167,'2025-07-09',1,'刘斌','交接班及填写交接班记录、临时工作打分',10,'值班',0,'北京站'),(168,'2025-07-09',1,'刘斌','洗澡间清洁',30,'清理保洁',0,'北京站'),(169,'2025-07-09',1,'刘斌','值班室卫生清洁',15,'清理保洁',0,'北京站'),(170,'2025-07-09',1,'刘斌','值班（输油作业，包括安防巡检、记录、卫生）',75,'值班',0,'北京站'),(171,'2025-07-09',1,'刘斌','切换流程（现场操作）',30,'输油作业',0,'北京站'),(172,'2025-07-09',1,'刘斌','UPS放电测试及填写记录',30,'检测检查',0,'北京站'),(173,'2025-07-09',1,'刘斌','每日记录检查',5,'行政管理',0,'北京站'),(174,'2025-07-09',5,'黄彪','会议室卫生（每人次）',40,'清理保洁',0,'北京站'),(175,'2025-07-09',5,'黄彪','交接班及填写交接班记录、临时工作打分',10,'值班',0,'北京站'),(176,'2025-07-09',5,'黄彪','洗澡间清洁',30,'清理保洁',0,'北京站'),(177,'2025-07-09',5,'黄彪','防止管线涨压开展泄压操作',10,'输油作业',0,'北京站'),(178,'2025-07-09',5,'黄彪','值班室卫生清洁',15,'清理保洁',0,'北京站'),(179,'2025-07-09',5,'黄彪','值班（输油作业，包括安防巡检、记录、卫生）',75,'值班',0,'北京站'),(180,'2025-07-09',5,'黄彪','切换流程（现场操作）',30,'输油作业',0,'北京站'),(181,'2025-07-09',5,'黄彪','每日记录检查',5,'行政管理',0,'北京站'),(183,'2025-07-09',1,'刘斌','会议室卫生（每人次）',40,'清理保洁',0,'北京站');
/*!40000 ALTER TABLE `clerk_work` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `gru_pa`
--

DROP TABLE IF EXISTS `gru_pa`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `gru_pa` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `pa_num` int NOT NULL DEFAULT '0',
  `pa_content` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `pa_score` int NOT NULL DEFAULT '0',
  `pa_group` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `task_group` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `min_days` int NOT NULL DEFAULT '0',
  `multi_score` tinyint(1) NOT NULL DEFAULT '0',
  `default_task` tinyint DEFAULT '-1',
  `comm_task` tinyint DEFAULT '0',
  `StationCN` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  PRIMARY KEY (`ID`),
  KEY `nci_pa_num` (`pa_num`),
  KEY `nci_pa_score` (`pa_score`),
  KEY `nci_min_days` (`min_days`)
) ENGINE=InnoDB AUTO_INCREMENT=272 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `gru_pa`
--

LOCK TABLES `gru_pa` WRITE;
/*!40000 ALTER TABLE `gru_pa` DISABLE KEYS */;
INSERT INTO `gru_pa` VALUES (1,1,'值班（无输油作业，包括设备巡检、安防巡检、记录、卫生）',50,'全员','值班',0,0,-1,1,'北京站'),(2,3,'值班（输油作业，包括安防巡检、记录、卫生）',75,'全员','值班',0,0,-1,1,'北京站'),(3,5,'白班工作',60,'全员','值班',0,0,-1,1,'北京站'),(4,7,'交接班及填写交接班记录、临时工作打分',10,'全员','值班',0,0,1,1,'北京站'),(5,305,'启输',15,'全员','输油作业',0,0,-1,1,'北京站'),(6,307,'停输',10,'全员','输油作业',0,0,-1,1,'北京站'),(7,309,'切换流程（现场操作）',30,'全员','输油作业',0,0,-1,1,'北京站'),(8,311,'配合切换流程（现场确认）',15,'全员','输油作业',0,0,-1,1,'北京站'),(9,313,'切换过滤器/流量计',10,'全员','输油作业',0,0,-1,0,'北京站'),(10,315,'旋流器放沉/过滤器放沉',10,'全员','输油作业',0,0,-1,1,'北京站'),(11,317,'防止管线涨压开展泄压操作',10,'全员','输油作业',0,0,-1,0,'北京站'),(12,345,'监视、记录油品质量',50,'全员','通球扫线',0,0,-1,0,'北京站'),(13,347,'监控污油进罐液位',20,'全员','通球扫线',0,0,-1,0,'北京站'),(14,349,'流程切换',20,'全员','通球扫线',0,0,-1,0,'北京站'),(15,351,'配合取球',100,'全员','通球扫线',0,0,-1,0,'北京站'),(17,85,'紧固、更换压力表（每块）',15,'全员','维修保养',0,1,-1,0,'北京站'),(18,87,'更换过滤器安全阀（每块）/更换旋流器安全阀',30,'全员','维修保养',0,1,-1,0,'北京站'),(19,89,'阀门保养',30,'全员','维修保养',0,0,-1,0,'北京站'),(20,91,'更换泵、电机润滑油（每台泵组）',150,'全员','维修保养',0,1,-1,0,'北京站'),(21,93,'添加泵、电机润滑油（每处每次）',10,'全员','维修保养',0,1,-1,0,'北京站'),(22,95,'埋地罐提油',90,'全员','维修保养',0,0,-1,0,'北京站'),(23,97,'检查、清洗篮式过滤器',100,'全员','维修保养',0,0,-1,0,'北京站'),(24,99,'更换泵机械密封/泵轴承/电机轴承',300,'全员','维修保养',0,0,-1,0,'北京站'),(25,101,'电机除尘',100,'全员','维修保养',0,0,-1,0,'北京站'),(26,103,'拆泵联轴器',20,'全员','维修保养',0,0,-1,0,'北京站'),(27,105,'装泵联轴器',30,'全员','维修保养',0,0,-1,0,'北京站'),(28,107,'协助调试流量计等设备/协助拆装阀门等设备',20,'全员','维修保养',0,0,-1,0,'北京站'),(29,109,'检查维保清理阻火器',60,'全员','维修保养',0,0,-1,0,'北京站'),(30,111,'检查维保呼吸阀',60,'全员','维修保养',0,0,-1,0,'北京站'),(31,113,'更换压力表标签',2,'全员','维修保养',0,0,-1,0,'北京站'),(32,115,'清洗泄压阀前端过滤器（将要安装）',100,'全员','维修保养',0,0,-1,0,'北京站'),(33,117,'管道设备防腐刷漆、刷地坪漆等',30,'全员','维修保养',0,0,-1,0,'北京站'),(34,119,'配合清洗油罐',50,'全员','维修保养',0,0,-1,0,'北京站'),(35,319,'新滤芯出库搬运',60,'全员','过滤器更换',0,0,-1,0,'北京站'),(36,321,'新滤芯拆箱及向上传递',80,'全员','过滤器更换',0,0,-1,0,'北京站'),(37,323,'旧滤芯卸车',80,'全员','过滤器更换',0,0,-1,0,'北京站'),(38,325,'从近端过滤器中提取旧滤芯',80,'全员','过滤器更换',0,0,-1,0,'北京站'),(39,327,'从中端过滤器中提取旧滤芯',100,'全员','过滤器更换',0,0,-1,0,'北京站'),(40,329,'从远端过滤器中提取旧滤芯',120,'全员','过滤器更换',0,0,-1,0,'北京站'),(41,331,'从过滤器中提取旧滤芯',60,'全员','过滤器更换',0,0,-1,0,'北京站'),(42,333,'过滤器端盖螺栓松开和紧固',30,'全员','过滤器更换',0,0,-1,0,'北京站'),(43,335,'过滤器密封圈更换',15,'全员','过滤器更换',0,0,-1,0,'北京站'),(44,337,'过滤器揭示牌填写',5,'全员','过滤器更换',0,0,-1,0,'北京站'),(45,339,'过滤器更换完毕后总巡查',30,'全员','过滤器更换',0,0,-1,0,'北京站'),(46,341,'过滤器更换记录',5,'全员','过滤器更换',0,0,-1,0,'北京站'),(47,343,'滤芯出入库记录填写',5,'全员','过滤器更换',0,0,-1,0,'北京站'),(48,13,'UPS放电测试及填写记录',30,'刘斌','检测检查',88,0,-1,0,'北京站'),(49,15,'消防器材检查、擦拭、填写记录',50,'王磊','检测检查',0,0,-1,0,'北京站'),(50,17,'更换消防器材（每年一次，包含送检及接收）',40,'全员','检测检查',0,0,-1,0,'北京站'),(51,19,'摇测接地电阻（每处）',10,'全员','检测检查',0,1,-1,0,'北京站'),(52,21,'泄压阀开启值调整',15,'全员','检测检查',0,0,-1,0,'北京站'),(53,23,'泄压阀有效性检测',60,'全员','检测检查',0,0,-1,0,'北京站'),(54,25,'配合开展安全检查',10,'全员','检测检查',0,0,-1,0,'北京站'),(55,27,'安全自查/专项自查（含记录填写）',25,'全员','检测检查',0,0,-1,0,'北京站'),(56,29,'配合防雷检测',15,'全员','检测检查',0,0,-1,0,'北京站'),(57,31,'配合可燃气体监测（每处）',3,'全员','检测检查',0,1,-1,0,'北京站'),(58,33,'配合消电检检测',20,'全员','检测检查',0,0,-1,0,'北京站'),(59,35,'测试消防报警按钮（两处）',10,'全员','检测检查',0,0,-1,0,'北京站'),(60,37,'检查火灾报警控制器（每周一）',3,'全员','检测检查',0,0,-1,0,'北京站'),(61,39,'打扫接油棚地面，清洁泵组及附属管线、阀门、过滤器等(每季度一次)',150,'全员','清理保洁',88,0,-1,0,'北京站'),(62,41,'清除接油棚杂物及杂草',10,'全员','清理保洁',0,0,-1,0,'北京站'),(63,43,'清扫站区内积雪',80,'全员','清理保洁',0,0,-1,0,'北京站'),(64,45,'清扫操控台下机柜、清扫PLC机柜及网络机柜（每季度）',60,'全员','清理保洁',0,0,-1,0,'北京站'),(65,47,'便池清洁',50,'全员','清理保洁',0,0,-1,1,'北京站'),(66,49,'洗手池清洁',20,'全员','清理保洁',0,0,-1,1,'北京站'),(67,51,'洗澡间清洁',30,'全员','清理保洁',0,0,1,1,'北京站'),(68,53,'清扫站内落叶',40,'全员','清理保洁',0,0,-1,0,'北京站'),(69,55,'值班室卫生清洁',15,'全员','清理保洁',0,0,1,1,'北京站'),(70,57,'办公室卫生清洁',15,'全员','清理保洁',0,0,-1,1,'北京站'),(71,59,'会议室卫生（每人次）',40,'全员','清理保洁',0,0,1,1,'北京站'),(72,61,'擦拭泵区渗油点（每处）',5,'全员','清理保洁',0,1,-1,0,'北京站'),(73,63,'每周一次大扫除',150,'全员','清理保洁',0,0,-1,0,'北京站'),(74,65,'清洗空调滤网（每台）（每半年一次）',10,'全员','清理保洁',0,1,-1,0,'北京站'),(75,67,'刷饮用水桶/水管',15,'全员','清理保洁',0,0,-1,0,'北京站'),(76,69,'洗凉床单（每条）',10,'全员','清理保洁',0,1,-1,0,'北京站'),(77,71,'擦玻璃（门斗）',150,'全员','清理保洁',0,0,-1,0,'北京站'),(78,73,'擦玻璃（控制室）',90,'全员','清理保洁',0,0,-1,0,'北京站'),(79,75,'擦玻璃（会议室）',60,'全员','清理保洁',0,0,-1,0,'北京站'),(80,77,'擦玻璃（3间值班室）',90,'全员','清理保洁',0,0,-1,0,'北京站'),(81,79,'擦玻璃（北侧卫生间+洗澡间）',75,'全员','清理保洁',0,0,-1,0,'北京站'),(82,81,'擦玻璃（南侧办公室）',120,'全员','清理保洁',0,0,-1,0,'北京站'),(83,83,'擦玻璃（南侧卫生间+洗澡间）',90,'全员','清理保洁',0,0,-1,0,'北京站'),(84,273,'财务报销（包含审核与贴票）',10,'穆天赛','财务工作',0,0,-1,0,'北京站'),(85,275,'帐目管理',50,'穆天赛','财务工作',0,0,-1,0,'北京站'),(86,277,'请款',5,'穆天赛','财务工作',0,0,-1,0,'北京站'),(87,279,'年底结算',30,'穆天赛','财务工作',0,0,-1,0,'北京站'),(88,281,'水电费结算工作（包含去动力能源公司进行费用分割）',50,'穆天赛','财务工作',0,0,-1,0,'北京站'),(89,283,'饭卡充值工作（包含取收据及充值）',50,'穆天赛','财务工作',0,0,-1,0,'北京站'),(90,285,'社保基数核定',20,'穆天赛','财务工作',0,0,-1,0,'北京站'),(91,287,'国家企业信息报送工作',20,'穆天赛','财务工作',0,0,-1,0,'北京站'),(92,289,'商险药费报销',30,'穆天赛','财务工作',0,0,-1,0,'北京站'),(93,291,'社保系统日常维护',30,'穆天赛','财务工作',0,0,-1,0,'北京站'),(94,293,'社保系统增减员(非现场)',20,'穆天赛','财务工作',0,0,-1,0,'北京站'),(95,295,'社保系统增减员(现场)',40,'穆天赛','财务工作',0,0,-1,0,'北京站'),(96,297,'误餐统计',20,'穆天赛','财务工作',0,0,-1,0,'北京站'),(97,299,'办理北京站询证函',20,'穆天赛','财务工作',0,0,-1,0,'北京站'),(98,301,'每季度前往建行办理对账单',20,'穆天赛','财务工作',0,0,-1,0,'北京站'),(99,303,'快递费月结统计',20,'穆天赛','财务工作',0,0,-1,0,'北京站'),(100,121,'管理滤芯库房(每月一次)',50,'刘泽坤','行政管理',28,0,-1,0,'北京站'),(101,123,'计量台账管理(每月一次)',30,'王磊','行政管理',28,0,-1,0,'北京站'),(102,125,'办公物品出入库管理(每月一次)',80,'穆天赛','行政管理',28,0,-1,0,'北京站'),(103,127,'管理工具柜及物资台账（含应急器材、应急器材柜管理, 每月一次）',60,'罗泽朝','行政管理',28,0,-1,0,'北京站'),(104,129,'管理北京站设备台账及设备管理系统(每月一次)',40,'刘斌','行政管理',28,0,-1,0,'北京站'),(105,131,'上报北京站周月报表、考勤表、值班表、值班带班费表、高温津贴表、各种台账、培训计划表等报表',10,'王磊','行政管理',0,0,-1,0,'北京站'),(106,133,'上报请示',5,'王磊','行政管理',0,0,-1,0,'北京站'),(107,135,'常用请示',15,'王磊','行政管理',0,0,-1,0,'北京站'),(108,137,'专项请示',30,'王磊','行政管理',0,0,-1,0,'北京站'),(109,139,'填写北京站会议记录',10,'全员','行政管理',0,0,-1,0,'北京站'),(110,141,'填写北京站培训记录/演练记录',10,'全员','行政管理',0,0,-1,0,'北京站'),(111,143,'上报北京站全年员工休假计划/统计北京站全年员工休假情况',5,'全员','行政管理',0,0,-1,0,'北京站'),(112,145,'专项活动总结/年中、年度工作计划、工作总结（每篇）',15,'全员','行政管理',0,1,-1,0,'北京站'),(113,147,'主写写异常事件报告',30,'全员','行政管理',0,0,-1,0,'北京站'),(114,149,'协助写异常事件报告',10,'全员','行政管理',0,0,-1,0,'北京站'),(115,151,'填写北京站设备维修记录',5,'全员','行政管理',0,0,-1,0,'北京站'),(116,153,'编制操作规程/规章制度/应急预案/演练方案/专项方案',100,'全员','行政管理',0,0,-1,0,'北京站'),(117,155,'培训记录电子版编辑',10,'全员','行政管理',0,0,-1,0,'北京站'),(118,157,'班组活动出题及打印判卷归档',20,'全员','行政管理',0,0,-1,0,'北京站'),(119,159,'专项培训考题（含党务类）',30,'全员','行政管理',0,0,-1,0,'北京站'),(120,161,'更新隐患治理档案电子台账',10,'全员','行政管理',0,0,-1,0,'北京站'),(121,163,'党小组相关记录文件撰写（每篇）',10,'全员','行政管理',0,1,-1,0,'北京站'),(122,165,'填报整改记录',10,'全员','行政管理',0,0,-1,0,'北京站'),(123,167,'安全驾驶北京站车辆并填写行车记录(单程)',10,'全员','行政管理',0,0,-1,1,'北京站'),(124,169,'安全驾驶北京站车辆并填写行车记录(往返)',20,'全员','行政管理',0,0,-1,1,'北京站'),(125,171,'北京站车辆加油并填写加油记录及行车记录',20,'全员','行政管理',0,0,-1,0,'北京站'),(126,173,'北京站车辆清洗',30,'全员','行政管理',0,0,-1,0,'北京站'),(127,175,'采买生产资料，低值易耗品',5,'全员','行政管理',0,0,-1,0,'北京站'),(128,177,'采买生产资料，低值易耗品（含开票）并结算报销',10,'全员','行政管理',0,0,-1,0,'北京站'),(129,179,'办公用品、记录本的申领',5,'全员','行政管理',0,0,-1,0,'北京站'),(130,181,'劳保用品（包括工服）订单统计',10,'全员','行政管理',0,0,-1,0,'北京站'),(131,183,'劳保用品（包括工服）到站后进行核对（包含破损统计）与分发',20,'全员','行政管理',0,0,-1,0,'北京站'),(132,185,'申领生产资料/换季保养材料',10,'全员','行政管理',0,0,-1,0,'北京站'),(133,187,'车辆维修询价及上报',20,'全员','行政管理',0,0,-1,0,'北京站'),(134,189,'北京站车辆送修',20,'全员','行政管理',0,0,-1,0,'北京站'),(135,191,'车辆年检',50,'全员','行政管理',0,0,-1,0,'北京站'),(136,193,'参加月度安全生产例会',10,'全员','行政管理',0,0,-1,0,'北京站'),(137,195,'参加公司会议、培训、演练等活动（每小时）',10,'全员','行政管理',0,1,-1,0,'北京站'),(138,197,'新闻报道公司公众号',20,'全员','行政管理',0,0,-1,0,'北京站'),(139,199,'物流公众号',30,'全员','行政管理',0,0,-1,0,'北京站'),(140,201,'VPN（集团公众号）',80,'全员','行政管理',0,0,-1,0,'北京站'),(141,203,'编辑公司公众号、物流公众号',10,'全员','行政管理',0,0,-1,0,'北京站'),(142,205,'编辑集团公众号（每篇）',20,'全员','行政管理',0,1,-1,0,'北京站'),(143,207,'防汛工作对接员(每月一次)',20,'全员','行政管理',28,0,-1,0,'北京站'),(144,209,'培训实习生、新职员、施工人员（每次）',100,'全员','行政管理',0,1,-1,0,'北京站'),(145,211,'完成专项课题（含资料收集、整理，课件、影视频制作等）',600,'全员','行政管理',0,0,-1,0,'北京站'),(146,213,'制作培训课件（站内、中心、公司授课使用）（工作量小）',100,'全员','行政管理',0,0,-1,0,'北京站'),(147,215,'制作培训课件（站内、中心、公司授课使用）（工作量中）',200,'全员','行政管理',0,0,-1,0,'北京站'),(148,217,'制作培训课件（站内、中心、公司授课使用）（工作量大）',300,'全员','行政管理',0,0,-1,0,'北京站'),(149,219,'站内授课',40,'全员','行政管理',0,0,-1,0,'北京站'),(150,221,'中心授课',60,'全员','行政管理',0,0,-1,0,'北京站'),(151,223,'公司授课',80,'全员','行政管理',0,0,-1,0,'北京站'),(152,225,'班组内开展培训（留存记录或照片）',10,'全员','行政管理',0,0,-1,0,'北京站'),(153,227,'参加应急演练桌面',10,'全员','行政管理',0,0,-1,0,'北京站'),(154,229,'班组实战（留存照片）',20,'全员','行政管理',0,0,-1,0,'北京站'),(155,231,'站内及公司实战',30,'全员','行政管理',0,0,-1,0,'北京站'),(156,233,'做迎检准备',10,'全员','行政管理',0,0,-1,0,'北京站'),(157,235,'监护施工、维修、作业（每小时）（需在记录中明确监护时间区间）',20,'全员','行政管理',0,1,-1,0,'北京站'),(158,237,'办公电脑维护',20,'全员','行政管理',0,0,-1,0,'北京站'),(159,239,'收集、整理影视频、图片资料',15,'全员','行政管理',0,0,-1,0,'北京站'),(160,241,'检查药箱药品是否过期并更新表格',10,'全员','行政管理',0,0,-1,0,'北京站'),(161,243,'配合抄电表/水表',5,'全员','行政管理',0,0,-1,0,'北京站'),(162,245,'办理特殊作业票（包括安全教育、风险分析等相关报表）',50,'全员','行政管理',0,0,-1,0,'北京站'),(163,247,'含油废弃物储存间管理(每月一次)',30,'全员','行政管理',28,0,-1,0,'北京站'),(164,249,'管理维护公共安全帽、反光背心',20,'全员','行政管理',0,0,-1,0,'北京站'),(165,251,'管理吸油棉箱、静电导除装置、展板、警示牌、磁翻板液位计、应急器材柜等(每月一次)',30,'全员','行政管理',28,0,-1,0,'北京站'),(166,253,'每季度参加企安安培训与考核',30,'王磊/罗泽朝','行政管理',0,0,-1,0,'北京站'),(167,255,'合理化建议（每条）',10,'全员','行政管理',0,1,-1,0,'北京站'),(168,257,'合理化建议被采纳（每条）',20,'全员','行政管理',0,1,-1,0,'北京站'),(169,259,'每日记录检查',5,'全员','行政管理',0,0,1,1,'北京站'),(170,261,'月末记录检查',15,'全员','行政管理',0,0,-1,0,'北京站'),(171,263,'临时工作记录统计整理',15,'全员','行政管理',0,0,-1,0,'北京站'),(172,265,'党务工作管理(每月一次)',20,'全员','行政管理',28,0,-1,0,'北京站'),(173,267,'因公取证/培训/出差(每天)',60,'全员','行政管理',0,1,-1,0,'北京站'),(175,269,'站内图书资料管理(每月一次)',10,'全员','行政管理',28,0,-1,0,'北京站'),(176,9,'加班(每小时)',10,'全员','加班',0,1,-1,0,'北京站'),(177,11,'主动加班(每小时)',12,'全员','加班',0,1,-1,0,'北京站'),(178,353,'填写通球扫线报告',20,'全员','通球扫线',0,0,-1,0,'北京站'),(179,271,'月末记录检查发现错误',2,'全员','行政管理',0,1,-1,0,'北京站');
/*!40000 ALTER TABLE `gru_pa` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `gru_pa_deduct`
--

DROP TABLE IF EXISTS `gru_pa_deduct`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `gru_pa_deduct` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `pa_num` int NOT NULL DEFAULT '0',
  `pa_content` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `pa_score` tinyint NOT NULL DEFAULT '0',
  `StationCN` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  PRIMARY KEY (`ID`),
  KEY `nci_pa_num` (`pa_num`),
  KEY `nci_pa_score` (`pa_score`)
) ENGINE=InnoDB AUTO_INCREMENT=281 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `gru_pa_deduct`
--

LOCK TABLES `gru_pa_deduct` WRITE;
/*!40000 ALTER TABLE `gru_pa_deduct` DISABLE KEYS */;
INSERT INTO `gru_pa_deduct` VALUES (1,1,'工作不认真',-2,'北京站'),(2,3,'工作未完成',-3,'北京站'),(3,5,'工作有错误',-5,'北京站'),(4,7,'不服从工作安排',-10,'北京站'),(276,9,'工作有错误test',-9,'北京站'),(277,11,'不服从工作安排ss',-10,'北京站'),(278,13,'不服从工作安排ssss',-10,'北京站'),(279,15,'不服从工作安排s',-10,'北京站'),(280,17,'工作未完成s',-3,'北京站');
/*!40000 ALTER TABLE `gru_pa_deduct` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `notices`
--

DROP TABLE IF EXISTS `notices`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `notices` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `notice` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `start_time` date NOT NULL,
  `end_time` date NOT NULL,
  `publisher` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `pub_time` datetime NOT NULL,
  `StationCN` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  PRIMARY KEY (`ID`),
  KEY `clus_time` (`start_time`,`end_time`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `notices`
--

LOCK TABLES `notices` WRITE;
/*!40000 ALTER TABLE `notices` DISABLE KEYS */;
/*!40000 ALTER TABLE `notices` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `package_info`
--

DROP TABLE IF EXISTS `package_info`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `package_info` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `package_name` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `package_ver` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  PRIMARY KEY (`ID`)
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `package_info`
--

LOCK TABLES `package_info` WRITE;
/*!40000 ALTER TABLE `package_info` DISABLE KEYS */;
INSERT INTO `package_info` VALUES (1,'GRU-PA','0.2.242'),(2,'Python','3.11.7'),(3,'MySQL','8.4.5'),(4,'streamlit','1.46.1'),(5,'pandas','2.3.0'),(6,'plotly','6.2.0'),(7,'openpyxl','3.1.5'),(8,'python-docx','1.2.0'),(9,'GRU-PA_last-updated','0.2.242'),(11,'PyJWT','2.10.1'),(12,'NumPY','1.26.4');
/*!40000 ALTER TABLE `package_info` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `users` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `userID` int NOT NULL,
  `userCName` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `userType` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `StationCN` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `userPassword` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `clerk_pa` tinyint DEFAULT '1',
  `clerk_type` tinyint DEFAULT '0',
  PRIMARY KEY (`ID`),
  KEY `nci_useid` (`userID`)
) ENGINE=InnoDB AUTO_INCREMENT=90 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES (1,1,'刘斌','admin','北京站','U2FsdGVkX194SKbzfycqts8Ho99vnLwHQIP78cBqxZ0=',1,1),(2,2,'于涛','admin','北京站','U2FsdGVkX1+dssFo4EYsvRuiyZYnAGUQEpyXcUee/3Q=',0,0),(3,3,'蔚江军','admin','北京站','U2FsdGVkX19CUid39R7p6wMLMhRLqtj4MDbzeYF1FFg=',0,0),(4,4,'罗泽朝','user','北京站','U2FsdGVkX1/qYuqLBW++JLMuwVh+SRrKeCsbudL6waM=',1,1),(5,5,'黄彪','user','北京站','U2FsdGVkX185G5av5BUqy6kfL9Y9uvrfqGSepTmOGPk=',1,1),(6,6,'王磊','user','北京站','U2FsdGVkX1/JzQNqtEqNuWGgTt1bwz7UBbZYqwI47f4=',1,0),(7,7,'连春生','user','北京站','U2FsdGVkX1/9x8EnJz1LinbJc9CHdMV52IP4qs+/yKI=',1,1),(8,8,'穆天赛','user','北京站','U2FsdGVkX1+Bxxyzsb6Eug8p687ZNQIlVYzDHY/GCZs=',1,0),(9,9,'穆玲','user','北京站','U2FsdGVkX18nLb8dwnRYzwFufhOinfkJebHZd1nGS5c=',1,1),(10,10,'刘泽坤','user','北京站','U2FsdGVkX1+CfoZTOasxy7yaKzxJ20BYXYYEsu61/cU=',1,0),(11,11,'杜操','user','北京站','U2FsdGVkX18TAi1sE45a83ebirfsLr4jmSmCqTV/VX4=',1,1),(12,12,'于斌','user','北京站','U2FsdGVkX18TAi1sE45a83ebirfsLr4jmSmCqTV/VX4=',1,1);
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `verinfo`
--

DROP TABLE IF EXISTS `verinfo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `verinfo` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `pyFile` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `pyLM` int NOT NULL,
  `pyMC` int NOT NULL,
  PRIMARY KEY (`ID`)
) ENGINE=InnoDB AUTO_INCREMENT=5257 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `verinfo`
--

LOCK TABLES `verinfo` WRITE;
/*!40000 ALTER TABLE `verinfo` DISABLE KEYS */;
INSERT INTO `verinfo` VALUES (1,'commFunc',1752203227,14),(2,'visitcounter',207,0),(3,'mysql_pool',1751973149,5),(4,'gru-pa',1752247434,191),(5,'gen_badges',1752118354,22),(6,'gd_weather',1752232387,5),(7,'hf_weather',1752241319,5);
/*!40000 ALTER TABLE `verinfo` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `weather_history`
--

DROP TABLE IF EXISTS `weather_history`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `weather_history` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `weather_date` date NOT NULL,
  `city_code` tinytext COLLATE utf8mb4_unicode_ci NOT NULL,
  `city_name` tinytext COLLATE utf8mb4_unicode_ci NOT NULL,
  `sunrise` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `sunset` tinytext COLLATE utf8mb4_unicode_ci NOT NULL,
  `moonrise` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `moonset` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `moonPhase` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `tempMax` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `tempMin` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `humidity` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `pressure` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `moon_icon` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `temp_icon` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `humidity_icon` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `temp_hourly` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `weather_hourly` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `precip_hourly` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `windir_hourly` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `windscale_hourly` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `windspeed_hourly` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `humidity_hourly` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `pressure_hourly` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `weather_icon_hourly` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  PRIMARY KEY (`ID`),
  KEY `nci_weather_date` (`weather_date`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `weather_history`
--

LOCK TABLES `weather_history` WRITE;
/*!40000 ALTER TABLE `weather_history` DISABLE KEYS */;
INSERT INTO `weather_history` VALUES (1,'2025-07-10','101010400','顺义区','04:53','19:46','19:40','03:37','盈凸月','30','23','93','1006','🌔','⚠️ 较热','💦 潮湿','28/28/27/26/25/24/25/25/24/23/24/25/25/26/26/28/28/28/30/29/28/27/27/27','阴/雾/雾/中雨/中雨/小雨/小雨/小雨/大雨/中雨/小雨/阴/阴/多云/多云/阴/阴/阴/阴/多云/阴/阴/阴/多云','0.0/0.0/0.0/0.0/3.0/9.0/2.0/0.0/1.0/36.0/10.0/1.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0','南风/东风/东北风/西风/南风/西北风/北风/北风/西南风/西南风/北风/北风/东北风/东风/北风/西北风/东北风/北风/北风/东风/东北风/东北风/东北风/北风','3/3/2/2/2/1/1/2/2/1/2/2/1/1/1/2/2/2/1/2/1/1/1/1','12/12/8/6/11/4/3/6/10/4/9/6/5/5/4/9/6/6/5/7/3/5/5/4','75/81/83/100/100/100/100/100/100/100/100/100/100/98/95/92/85/81/72/81/92/97/100/100','1005/1005/1005/1006/1006/1005/1006/1006/1008/1007/1007/1008/1008/1007/1007/1006/1006/1006/1006/1005/1006/1006/1007/1007','⛅/🌫️/🌫️/🌧️/🌧️/🌦️/🌦️/🌦️/🌧️/🌧️/🌦️/⛅/⛅/☁️/☁️/⛅/⛅/⛅/⛅/☁️/⛅/⛅/⛅/☁️'),(2,'2025-07-01','101010400','顺义区','04:48','19:48','10:46','23:28','蛾眉月','30','24','87','1001','🌒','⚠️ 较热','💦 潮湿','28/25/24/24/24/24/24/24/25/25/26/28/27/28/29/30/30/29/29/29/28/27/27/26','雾/大雨/阴/雾/雾/雾/雾/雾/雾/雾/阴/阴/阴/阴/阴/多云/晴/晴/晴/晴/晴/晴/多云/阴','0.0/0.0/14.0/5.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0','南风/南风/东北风/东北风/东北风/东南风/北风/东风/西南风/南风/南风/西南风/南风/南风/南风/南风/南风/南风/南风/南风/南风/南风/东南风/东南风','1/5/1/2/2/0/1/2/1/3/3/3/2/3/3/2/2/3/3/2/3/2/1/2','5/35/3/8/6/1/4/7/5/12/16/18/11/17/14/10/10/14/12/8/12/9/4/7','78/100/100/100/100/100/100/100/100/100/93/77/85/78/74/69/66/74/74/77/81/88/92/95','1000/1001/1000/1000/1000/1000/1001/1001/1002/1002/1002/1002/1002/1002/1001/1000/1000/1000/1000/1001/1001/1002/1003/1003','🌫️/🌧️/⛅/🌫️/🌫️/🌫️/🌫️/🌫️/🌫️/🌫️/⛅/⛅/⛅/⛅/⛅/☁️/☀️/☀️/☀️/☀️/☀️/☀️/☁️/⛅'),(3,'2025-07-02','101010400','顺义区','04:48','19:48','11:48','23:48','蛾眉月','32','25','83','1002','🌒','⚠️ 较热','💦 潮湿','26/26/26/26/26/25/25/26/27/28/29/30/31/32/32/32/32/32/30/29/29/27/26/26','雾/雾/雾/雾/雾/雾/雾/雾/雾/雾/雾/雾/雾/阴/阴/阴/阴/阴/阴/雾/雾/阴/阴/阴','0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0','东北风/东风/东风/东风/东风/东风/南风/东南风/南风/南风/东南风/西北风/东北风/东风/东南风/东风/东南风/东南风/南风/东南风/南风/东风/东风/南风','0/1/1/1/1/1/1/1/2/1/2/2/2/1/3/2/1/3/3/2/3/2/1/2','1/5/4/3/4/3/3/4/11/5/9/9/6/5/12/9/4/13/16/9/16/7/3/8','98/98/99/100/100/100/100/98/95/93/81/74/70/62/59/58/60/60/74/80/78/84/86/90','1003/1003/1003/1003/1003/1003/1004/1004/1004/1004/1004/1004/1003/1002/1002/1001/1001/1000/1001/1001/1002/1002/1002/1001','🌫️/🌫️/🌫️/🌫️/🌫️/🌫️/🌫️/🌫️/🌫️/🌫️/🌫️/🌫️/🌫️/⛅/⛅/⛅/⛅/⛅/⛅/🌫️/🌫️/⛅/⛅/⛅'),(4,'2025-07-03','101010400','顺义区','04:49','19:48','12:49','00:05','上弦月','28','25','97','999','🌓','⚠️ 较热','💦 潮湿','25/25/26/25/25/25/25/25/25/25/26/27/27/27/27/27/28/28/27/27/27/27/27/26','阴/阴/阴/阴/小雨/雾/雾/小雨/雾/雾/阴/阴/阴/阴/小雨/雾/雾/雾/雾/雾/雾/雾/雾/雾','0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0','西风/南风/北风/东北风/东风/东南风/东风/南风/东风/南风/南风/北风/南风/东风/东风/东风/西南风/东风/东南风/东风/南风/南风/东风/东南风','1/1/2/1/1/1/2/1/1/1/1/1/1/2/1/1/1/1/1/2/1/1/1/2','3/4/9/5/3/3/8/5/5/4/3/4/5/6/4/5/3/4/3/8/3/4/5/7','100/98/99/100/100/100/100/100/100/100/100/92/92/88/95/93/93/91/98/97/100/100/100/100','1001/1000/999/1000/999/999/999/1000/1000/1000/1000/999/999/999/999/998/998/998/998/998/998/998/999/998','⛅/⛅/⛅/⛅/🌦️/🌫️/🌫️/🌦️/🌫️/🌫️/⛅/⛅/⛅/⛅/🌦️/🌫️/🌫️/🌫️/🌫️/🌫️/🌫️/🌫️/🌫️/🌫️'),(5,'2025-07-04','101010400','顺义区','04:49','19:48','13:49','00:07','盈凸月','34','26','81','997','🌔','⚠️ 较热','💦 潮湿','26/26/26/26/26/26/26/26/28/29/29/31/32/33/33/34/34/34/33/32/31/31/30/30','雾/雾/雾/雾/雾/雾/雾/雾/雾/雾/雾/雾/多云/阴/晴/晴/晴/晴/晴/多云/多云/阴/阴/雾','0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0','东南风/东南风/东南风/南风/南风/南风/南风/南风/东北风/南风/西风/西北风/南风/东南风/西风/东南风/南风/南风/南风/南风/东南风/东南风/南风/西南风','2/2/1/1/1/1/1/1/1/2/1/2/2/1/2/2/2/3/3/3/3/2/1/1','7/11/4/5/3/4/2/4/4/9/5/6/8/5/8/8/10/18/14/15/13/7/4/3','100/100/100/100/100/100/100/100/97/89/80/70/64/65/62/60/61/61/64/67/72/74/79/83','998/998/998/998/998/998/999/999/999/999/998/998/998/997/997/996/995/995/995/995/995/996/996/996','🌫️/🌫️/🌫️/🌫️/🌫️/🌫️/🌫️/🌫️/🌫️/🌫️/🌫️/🌫️/☁️/⛅/☀️/☀️/☀️/☀️/☀️/☁️/☁️/⛅/⛅/🌫️'),(6,'2025-07-05','101010400','顺义区','04:50','19:47','14:51','00:28','盈凸月','35','25','69','995','🌔','⚠️ 较热','💧 舒适','30/29/29/28/27/25/25/26/26/27/30/32/33/33/35/34/34/34/33/33/31/30/29/29','雾/雾/雾/小雨/大雨/小雨/阴/阴/阴/阴/多云/多云/阴/多云/晴/晴/多云/多云/多云/晴/晴/晴/晴/晴','0.0/0.0/0.0/0.0/0.0/11.0/12.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0','东南风/东风/东南风/北风/南风/东北风/西南风/西风/西北风/西南风/西风/西北风/西北风/北风/北风/西北风/西北风/北风/北风/北风/北风/北风/西北风/西北风','2/1/1/1/5/2/1/1/1/1/2/2/4/3/3/3/3/3/2/2/2/2/2/2','9/3/4/5/29/7/4/2/4/4/11/11/25/12/14/19/15/18/6/7/8/7/6/11','88/91/96/100/100/100/100/100/100/100/79/65/49/53/44/42/42/39/41/44/49/50/54/51','995/995/995/994/994/994/995/994/995/995/995/995/995/995/995/995/996/996/997/998/999/1000/1000/1000','🌫️/🌫️/🌫️/🌦️/🌧️/🌦️/⛅/⛅/⛅/⛅/☁️/☁️/⛅/☁️/☀️/☀️/☁️/☁️/☁️/☀️/☀️/☀️/☀️/☀️'),(7,'2025-07-06','101010400','顺义区','04:50','19:47','15:53','00:54','盈凸月','34','25','51','1002','🌔','⚠️ 较热','💧 舒适','28/26/26/25/25/26/26/27/28/30/31/32/33/33/34/34/34/34/33/32/30/29/28/28','多云/晴/晴/多云/多云/多云/阴/阴/阴/多云/晴/晴/晴/晴/晴/晴/晴/晴/晴/晴/晴/晴/多云/阴','0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0','北风/西北风/东北风/北风/北风/北风/北风/北风/东北风/东北风/东北风/北风/东风/西南风/西南风/南风/西南风/西风/东南风/南风/南风/南风/东南风/南风','0/1/1/2/2/2/2/2/2/2/3/2/1/2/2/2/2/2/2/3/2/2/1/1','0/4/4/7/7/7/7/10/8/10/14/6/4/8/8/11/10/6/10/13/8/7/3/3','59/64/68/71/65/65/64/62/58/48/44/42/41/37/36/40/38/36/43/45/50/52/57/61','1000/1001/1002/1002/1002/1003/1003/1004/1004/1004/1004/1003/1003/1002/1002/1001/1001/1000/1000/1001/1001/1002/1002/1002','☁️/☀️/☀️/☁️/☁️/☁️/⛅/⛅/⛅/☁️/☀️/☀️/☀️/☀️/☀️/☀️/☀️/☀️/☀️/☀️/☀️/☀️/☁️/⛅'),(8,'2025-07-07','101010400','顺义区','04:51','19:47','16:55','01:22','盈凸月','34','25','55','1001','🌔','⚠️ 较热','💧 舒适','28/27/26/25/25/25/25/27/28/29/31/32/32/33/33/34/33/33/32/32/31/30/29/28','多云/晴/晴/阴/晴/阴/多云/晴/阴/阴/多云/晴/多云/阴/阴/阴/阴/多云/阴/阴/阴/阴/阴/阴','0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0','南风/南风/北风/东北风/东北风/东北风/北风/北风/东南风/东北风/北风/东风/西南风/东南风/西风/南风/南风/东南风/南风/南风/南风/南风/西风/南风','2/1/0/1/1/3/2/2/1/2/2/2/2/2/2/2/3/2/2/3/3/3/1/2','7/3/0/4/4/12/7/7/4/6/7/10/9/6/7/11/17/10/6/12/12/14/2/11','59/64/75/81/78/75/78/75/65/64/54/46/42/38/37/38/37/40/45/45/44/46/45/50','1002/1002/1002/1002/1002/1002/1002/1002/1002/1003/1002/1002/1002/1001/1000/1000/1000/999/999/1001/1002/1003/1003/1003','☁️/☀️/☀️/⛅/☀️/⛅/☁️/☀️/⛅/⛅/☁️/☀️/☁️/⛅/⛅/⛅/⛅/☁️/⛅/⛅/⛅/⛅/⛅/⛅'),(9,'2025-07-08','101010400','顺义区','04:52','19:46','17:55','01:59','盈凸月','30','25','69','1003','🌔','⚠️ 较热','💧 舒适','28/26/26/25/25/25/25/26/26/26/26/27/29/29/30/30/30/30/30/30/29/29/28/27','阴/阴/阴/阴/阴/多云/多云/阴/阴/阴/阴/阴/阴/阴/阴/阴/阴/阴/阴/阴/阴/阴/多云/多云','0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0','南风/南风/南风/东南风/北风/南风/南风/西南风/南风/南风/南风/东风/南风/北风/西南风/东南风/南风/南风/东南风/北风/东南风/北风/北风/北风','3/1/2/1/2/2/1/1/1/2/2/1/2/2/2/2/2/2/2/1/1/0/1/1','15/5/7/3/7/9/4/4/5/7/6/4/9/9/8/8/7/10/7/4/3/0/5/5','61/74/71/74/76/77/75/74/75/73/81/72/67/61/60/60/60/60/59/62/64/68/73/79','1002/1002/1002/1001/1001/1002/1003/1004/1005/1005/1005/1005/1005/1005/1004/1004/1004/1003/1004/1004/1004/1005/1005/1005','⛅/⛅/⛅/⛅/⛅/☁️/☁️/⛅/⛅/⛅/⛅/⛅/⛅/⛅/⛅/⛅/⛅/⛅/⛅/⛅/⛅/⛅/☁️/☁️'),(10,'2025-07-09','101010400','顺义区','04:52','19:46','18:51','02:43','盈凸月','33','26','72','1005','🌔','⚠️ 较热','💦 潮湿','27/27/27/26/26/26/26/27/28/29/29/30/31/31/32/32/33/33/32/31/30/29/29/28','阴/阴/阴/多云/雾/雾/雾/雾/雾/雾/雾/阴/阴/阴/阴/阴/阴/阴/阴/阴/阴/阴/阴/阴','0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0/0.0','北风/北风/西北风/东风/东北风/东南风/南风/东南风/东风/东北风/东南风/东风/东南风/西南风/东风/东南风/东风/东南风/南风/南风/南风/南风/东南风/南风','1/1/2/1/1/2/2/1/2/2/1/2/3/2/2/1/2/2/3/3/3/2/2/2','4/5/6/4/3/6/6/5/7/7/3/8/14/7/9/5/10/10/13/14/16/10/7/11','81/80/79/85/88/84/91/93/82/76/73/67/62/67/59/59/56/55/60/60/69/70/72/73','1005/1005/1005/1005/1005/1006/1006/1007/1007/1006/1006/1006/1006/1005/1005/1004/1003/1003/1003/1004/1004/1005/1005/1005','⛅/⛅/⛅/☁️/🌫️/🌫️/🌫️/🌫️/🌫️/🌫️/🌫️/⛅/⛅/⛅/⛅/⛅/⛅/⛅/⛅/⛅/⛅/⛅/⛅/⛅');
/*!40000 ALTER TABLE `weather_history` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-07-11 23:57:49
